<PAD>
1044285
7368
856005
72195
195449
359838
239755
427848
316564
1077049
7792
837240
581131
1030656
1220011
968221
79747
474675
266913
222667
332929
42898
760651
762279
881890
755561
697742
158493
979713
1219589
1108057
10120
31240
365865
145611
1125442
509221
991700
1121849
493242
1274033
159592
206763
641588
678940
699820
1082966
1063159
501313
544072
249303
1120647
852788
163882
807565
1252114
178976
1122654
394856
1007781
119827
75959
166965
623194
1223643
390051
1269463
433631
1035431
1160791
797945
793790
953821
568408
1064459
556634
750606
758892
538313
611112
365754
569999
386284
42610
1188406
626254
649585
1055727
18841
720160
420804
839598
473628
1136007
721845
390737
1057842
1017514
165432
1216909
430931
732391
994077
887082
494222
998012
62534
628499
979583
964907
247092
547877
828585
499065
360394
206394
760667
1219505
862363
599682
1159480
484473
1136931
909573
1231714
1105455
1223861
669302
643423
1209583
875695
383866
626902
664699
420000
196019
313405
836872
1232729
779285
486279
590921
468653
793630
788037
299237
177669
435522
973420
459347
666906
1225585
572805
826453
597295
124790
146911
559442
984047
206692
180386
186887
768900
449970
433802
861744
371412
342009
1273519
105340
830707
1017095
850377
415283
1120331
798177
780230
272235
1019450
983951
68696
258493
1022665
28352
639060
838536
737544
955883
337797
204426
337598
1261099
1230324
324149
1177293
235615
285876
291949
504767
1037539
1262723
41345
679073
1004858
822268
928594
103127
1158830
1010033
449525
60128
1234539
212163
625647
905418
262156
315822
1199983
1209331
1205281
636219
988730
57871
112530
1139063
1161763
1165265
1058423
898312
490538
876762
915677
1002079
1233168
290328
537700
348926
99552
1150026
1113018
616873
1140759
157530
129532
70637
758098
269807
1220165
89539
331227
1180622
272718
753262
942897
106357
790700
893686
549139
268876
506849
1108822
326498
676158
1155302
286936
178724
893126
263884
1222182
489094
595261
184021
633152
1016718
1106142
471748
617883
229154
796870
316300
773255
378979
259415
953800
59456
562056
700959
1046218
928395
1073727
540186
603367
140141
174103
484968
456335
981094
177571
1124351
1197553
970713
115995
202894
1206507
828236
542587
995243
737533
26533
1075070
1210194
490286
177198
6437
1215971
527455
260016
351076
1068835
935428
350937
570373
1225553
536530
605972
914012
548218
809455
412657
578154
1225691
105337
744866
422632
1117210
230719
585998
482578
518106
361264
979324
799951
219953
849828
1122688
330242
777564
195356
854549
622528
1140516
593192
950150
527957
462208
1172361
171803
87936
1274148
1002824
4665
126111
226739
486229
975704
803607
654372
545638
763491
1109214
661985
332232
663773
1252069
918076
961786
957317
989663
208154
520805
1226221
93932
426236
603710
730105
42903
518445
1219032
360600
537848
1116875
263861
265484
345037
600462
132960
476146
1141594
143738
472236
601396
376591
1126775
316709
925120
1218217
534723
450405
3211
487625
326505
156426
292474
600254
114495
686990
770757
21879
287765
55736
1103224
1242140
175475
358925
835198
204590
78249
815704
862965
104086
201130
839821
821297
333061
742183
1167313
1266092
1125206
122566
73234
1140778
1057970
236166
960862
1087134
718474
622428
679500
314007
508473
170331
902663
414420
1000712
1204721
297797
484565
647476
548507
530023
409862
2890
676941
28706
823142
631021
998335
21350
15602
144360
818144
284663
520285
919918
967671
42789
960694
1200335
940445
903060
766202
295821
674674
985531
26872
68790
168307
394336
936423
310859
914039
695381
1263682
932522
383295
105022
1186596
1107998
65669
1087704
402386
843217
932372
1094565
486215
1173724
1218166
1250524
1238107
9574
974701
493552
707023
1076236
146447
133528
1096575
986327
1123914
309595
975571
20547
1238054
133731
15318
465761
91645
336592
326218
812453
534703
453516
98211
288249
871428
861622
977266
333870
1019055
857711
923072
389237
121255
140430
1097341
190578
439580
255226
449838
563158
1108159
905056
514824
1176599
901380
1187656
100053
643843
713747
29924
1276540
126122
735627
811097
1016350
316275
313996
572766
1139354
819230
31757
924220
744841
262206
607202
550791
750867
1012955
1169505
891719
51210
153302
1274632
1253045
407052
660242
686051
658597
1250888
393322
26179
139922
1131623
460492
1142636
397739
721432
125310
1022616
360364
604455
882491
1043700
481583
394259
796797
235373
1070485
251131
19306
1159605
1264917
124887
361985
495163
610719
1091793
179640
495296
829302
734846
1014994
265988
524569
268683
690980
484671
525960
1083907
921820
313239
559909
1049548
93042
1191748
1101732
1103771
34048
846763
9916
159560
724386
967631
734011
1194229
747661
1235898
1167722
226278
896685
501118
695553
462287
498390
38280
532914
122455
30627
68160
1201957
612783
954965
396393
376855
275813
583747
654975
1168221
194922
1033204
707703
418166
1268524
651973
773094
1025490
436955
841134
475766
512300
425724
664581
40494
871977
175768
40862
319764
607120
746379
258373
61039
1240468
1077650
303215
899960
461165
1194702
490859
293272
706580
116849
604105
399668
82849
228827
499288
1178821
440324
513406
570900
189401
138292
490311
658824
704585
285352
442871
1096353
851280
695642
818333
1036815
47128
137414
647942
457213
92251
1014082
1080395
197634
67096
629093
187170
234178
264974
826392
221241
598604
1072243
1186178
1106636
937934
404951
329680
777130
878238
349430
559482
847059
1115109
393627
113290
514351
852015
354809
966819
587351
800961
528436
64489
1204356
849415
651455
389346
737612
910479
482098
800840
140193
67349
84528
380349
327158
848367
616994
956417
615799
850370
603902
1035104
13668
32020
371300
544109
1275496
951085
292286
787102
636025
706499
873355
747053
496899
1043671
138639
243891
528799
1089476
410256
204987
879592
186601
1060170
963451
732627
1238441
566220
1128431
1030191
471443
446312
45591
500239
417190
1233554
387708
1159911
313506
529134
739323
842764
1169891
667300
204365
12628
1033708
278708
616786
876463
452751
906756
760890
416419
498051
1253150
725232
943589
379046
672543
584181
348824
270476
569147
666182
243930
920912
1121017
1038275
296379
276639
680154
412347
1276369
219366
471545
907327
182130
1142502
350860
563480
940934
23543
690519
841133
646742
355239
969866
1098343
267264
884048
715931
807806
99261
1080029
171143
472252
1111942
1158038
249462
507306
102134
1197511
516451
256987
1243149
670052
618310
1231887
1216105
1098456
825496
506376
663425
865388
457848
919763
865349
285569
1064525
335169
887468
707274
963518
546827
911283
860679
581059
43709
1020724
669236
1091056
1226942
1203070
460552
924004
736199
619513
555819
1103812
698289
466409
535002
181675
1071095
907560
17196
23355
1059994
516612
649471
263634
1254333
596132
55499
755289
549983
1215246
830435
13
986218
494226
1005139
670411
1061950
1204379
946270
183329
45680
1236753
566742
638900
749531
1024108
793354
1271111
510417
327203
998867
480845
75592
197886
258775
785835
1147125
226345
473865
1233637
860822
633931
418696
1160464
762533
548576
762859
322926
831159
683971
1223640
1113185
715003
620524
553691
137572
704757
620843
79840
1213861
584418
1207412
243835
876186
325501
875587
1200623
704108
9155
240433
726844
247077
789434
529435
65672
681932
1123842
1244134
868779
233534
733154
540981
1061961
442844
410346
409285
180158
744819
134738
1088009
338553
404157
272575
743139
1029630
941291
895138
702100
251046
551872
878425
727489
1259474
878435
567403
287926
311819
808732
387321
1125799
133408
875399
331697
110562
233100
756882
230592
1044155
1265303
172207
744180
1100129
239992
177053
4889
1004267
703393
1018169
643917
641396
242905
255832
514510
606023
1123801
486095
1148868
586065
874799
1042245
410340
197337
214087
306028
563855
11828
291456
1021171
44781
65432
1212404
428834
455378
1272965
149300
455554
983610
316924
155248
656831
506247
359356
983909
396208
607448
54526
453271
877690
924182
653214
229059
1248811
56101
306807
96895
1234137
690659
618608
613628
275596
478062
1108951
862198
509946
235317
1064363
721502
780314
1122569
611448
532524
1226459
101107
457311
841705
1099084
566896
669032
654176
842072
264188
1279492
894952
904624
403970
991598
300835
523738
526141
1032553
475343
243428
134979
852866
812597
570574
275659
528784
431375
286057
5423
526612
1260946
1232371
986954
408232
132178
951686
230478
452961
904173
1041271
604430
933944
3941
756604
48091
41890
739655
482049
581088
993111
606111
212174
851858
342505
785412
174013
1212860
483138
322694
927498
293908
1017164
848114
10985
512836
317784
220561
344453
908883
184115
229516
924693
671564
1185428
779350
749990
446403
180178
307564
1159050
1152151
1005797
7220
355762
866033
890813
909868
562218
916286
757748
283948
988147
29046
1190633
417151
1109946
581775
1100748
1250237
259834
868633
446656
372290
500043
123904
849522
200472
138601
521303
945861
544300
502873
1220047
433357
662358
892538
933117
1073718
488726
730224
93712
1066152
1247521
796981
463122
138867
928040
1265784
151126
94030
655764
219384
354163
1056147
308828
569764
15766
1274957
164700
588948
109215
277823
46275
790069
966621
182700
144506
821442
738779
358305
708570
589659
289686
156702
839737
854576
1233520
283402
365352
1242176
743851
688828
219488
534368
529819
143281
955841
660014
847643
1111222
719696
605888
40555
107976
209907
682828
957421
689474
195827
704923
1138396
259247
598093
915373
1172102
915094
1125260
820956
177298
451877
750008
696885
954345
742921
1259689
260376
189578
487790
1208521
192554
940121
1115452
1274378
616836
524637
94045
399874
276355
803469
1093776
1179194
662448
463820
1236909
742440
1218216
783376
99887
574699
961228
274897
669026
1109791
244015
18426
856427
968962
17126
996472
499816
191904
448427
1058638
1116428
68836
694691
315520
1021446
637533
659743
1168023
24468
759698
849662
124863
537196
276033
1249392
481727
1190144
263464
957598
1103316
751233
332679
514915
818601
849079
709587
738078
340650
57097
622083
441138
1056301
451501
491118
236167
850666
293947
844897
1107980
523980
991653
931844
194334
75874
766712
112507
901876
191092
682495
662843
748964
1241890
464195
888363
1153803
428798
201931
431423
521297
741094
1264024
164260
710297
111134
151130
999514
585212
1143677
455109
696893
1250713
790871
628587
315619
553885
1052710
707896
1119566
836887
873419
312068
994103
873230
1022535
72184
359657
584074
1141647
433645
432596
952934
968890
1275468
1034690
894612
318722
705000
1274974
730478
143697
690409
509726
803817
103648
407657
132700
553352
87641
996173
678454
255075
523007
826455
651670
567106
502339
544562
562862
1205156
1090490
1099478
513640
397095
977170
903075
908539
971281
312399
441824
999197
1208001
912109
719982
70962
760713
732942
855437
549715
476822
84040
488833
461744
504701
1150959
184485
289572
858430
1181341
43151
108973
688549
883188
798484
865510
67180
893462
887555
289027
809888
156678
20105
982145
835010
1035402
322397
563179
831904
1191611
241082
157753
264438
1138806
1233920
836363
1086143
817220
1122650
760873
1054905
595304
744539
1026486
367959
284850
616082
401643
1230272
324189
1065511
1150332
350257
676542
828765
1209951
189252
675698
991734
825148
1091392
956170
1083356
822536
1032732
856846
426133
9426
397622
437890
614625
508847
466095
101032
260976
1236853
268505
726519
1048690
568789
259422
831703
911326
725152
466481
198417
448654
138610
811325
370621
691598
1179378
952665
1013913
1196089
683658
161104
478818
1165288
419160
522433
479631
1237079
769608
1113886
113075
216015
874999
143886
1253481
458197
1161910
659462
162939
194057
204435
1088991
61657
381359
882867
324836
246187
91125
361466
896954
717809
574781
355580
187445
54189
137703
186162
842588
1002098
1224005
291762
375888
137466
432942
70836
217539
647006
518147
82826
160507
1251386
888720
349702
244785
465970
1022980
90139
830498
1034330
468403
939136
580363
1096895
386569
1118173
490830
59717
1181686
198241
155706
48734
466351
57072
65419
431144
913490
938596
481847
315926
156536
272211
903387
840536
268410
325125
693357
829723
527571
243780
1248871
1190213
172167
1159930
669826
841894
165769
586102
431679
537096
808368
487575
1036205
735122
705370
347750
415555
282783
588013
191291
251040
163817
749496
605929
840947
927019
1122962
327402
928165
978131
1276225
405649
255373
570039
966988
1164004
122167
434860
998716
955933
132424
407271
988705
1215507
731855
446293
1184457
1040122
1170823
607038
53504
770902
709284
1232402
1197899
518370
584847
710131
696679
1099121
562589
875172
795373
663758
980451
143454
1040379
395134
1025620
388514
434137
779400
935827
758305
65284
942674
1125457
936769
754019
990754
1067170
104858
1250047
904961
661884
774432
1092529
1016810
731480
1091362
193859
1241338
126880
298833
975680
671984
913779
923551
591664
214428
258530
911455
1172671
871495
1196765
1040585
515027
899469
817738
320572
1064646
1001221
694160
1118032
315970
433236
955721
455740
710280
915040
1268151
1104514
713312
1066456
1042214
874879
613476
767433
1248698
445059
151943
177753
5017
19280
1251023
1085053
572757
375225
266553
672477
453693
494879
656382
857187
700132
420032
205723
882222
957371
441497
792140
500241
613030
764892
191394
799982
1161393
390143
477606
639341
139275
94315
48626
959539
589655
141529
1219079
872939
70189
884350
124156
31471
388786
947037
544882
319619
1213681
655891
804941
593232
22328
523433
439244
12718
282904
346052
722558
929056
440917
1197722
919371
401982
92074
469558
598366
515151
902253
636399
268338
138485
761452
1129339
243390
378541
612630
557664
810829
306381
89255
225257
568421
328717
766576
561141
820660
250160
129886
149900
790581
461909
1056759
837752
995865
147661
11517
1019800
6143
677084
873254
143048
882689
1170443
1150609
712021
731011
820804
843130
227335
701029
843598
152059
880998
748781
252884
608231
169667
1127036
604353
1251368
637684
377278
757988
67774
998666
454230
1046308
695836
124462
694848
1009224
1135411
1002952
453765
140352
625107
985773
465496
604121
92126
104189
1129504
345459
174198
910962
231468
724346
1159491
720055
1235080
245001
547011
55748
636429
632677
915652
1235696
1118360
1208025
582824
1137715
157329
1131084
967736
57367
708397
291569
695617
160113
771425
79785
1034897
377937
1185403
954737
39848
1070988
1140191
139746
370832
41841
592036
336767
757653
1203797
343034
1228995
1109243
1097183
1094314
674898
822172
638327
1000554
776605
826929
272747
481762
1145167
960864
209202
1114890
207526
830808
704005
619350
878513
433018
1090915
819295
354209
633847
748729
799372
791643
679242
854372
1099510
912855
123359
29668
13946
233252
161433
1086971
636767
936367
1047153
306948
157557
1230358
1108390
996532
225094
1097152
336074
170835
1048945
956248
308719
774656
452953
202259
504066
724624
787364
1039340
1252592
1204519
1061855
901874
1163988
120042
20042
1008876
707797
1221680
918043
346728
258611
143965
1010302
1245627
856802
251824
1102310
190798
781791
1104523
251191
393674
46200
534180
1049905
1277063
119673
495894
1070449
349959
957040
1199764
151656
644857
798125
880415
214061
1206
902205
163540
893995
1008293
450215
1150115
840045
67177
785495
869941
17302
88023
433815
451822
1176703
236190
1123695
647104
811160
512268
85768
600175
221970
295484
711687
724432
622289
1028092
550981
892848
502720
15830
1163454
1228115
543712
634659
40397
1012524
191373
355066
255842
1011331
35801
54217
667064
296165
197196
406798
1053981
657672
61235
33217
518289
949439
537766
1059640
38106
623518
847326
210194
227672
259213
448652
1265994
552693
763682
581471
591145
1265539
336084
951380
150445
528180
1102637
584317
866508
366962
879519
332896
1009926
643412
299391
369059
1262272
430272
848490
905127
819605
875499
641202
953479
1154908
1017462
386874
587003
1262890
1278932
750865
377785
188044
909655
1232411
487033
213761
669327
782584
833467
697673
867206
646847
878327
529832
811557
836
106104
1175787
544839
917169
1167930
1151480
100171
552840
589233
136567
910763
464702
687168
690316
333114
1235129
836345
458772
345430
1056048
233654
1217792
1149208
1194919
893881
26903
1173797
654447
594655
876347
232418
1121726
62099
90367
119191
353520
759923
756071
834785
822468
1101195
629413
284987
916871
347139
841708
322896
1271707
366953
241545
483904
697381
38635
813613
1237587
948657
394119
1236651
843851
1190614
557435
783605
264340
563910
669497
428396
653041
402392
632289
1271081
455520
879641
459718
992414
520982
370875
922550
1233066
347627
902003
505027
1259858
90657
1277107
205278
952582
779577
65795
416065
528070
1214084
1089615
261254
1245914
29237
214619
702804
373628
210925
1260438
1257988
1139175
8414
1220556
475749
145444
65711
853498
824788
869761
66536
922446
682773
1005784
22096
1212932
312667
1220861
907448
832279
190447
691052
30047
1082058
1165081
973444
1163866
1129541
976285
1176437
819024
189476
421472
104422
705671
1124551
707939
504123
213111
505077
894538
435861
406623
1131631
1035673
1046036
182803
1252714
175745
971706
1099587
535311
594103
861608
365920
1004479
78966
889697
150474
240637
721524
850630
878543
856203
275206
991111
915400
430950
603861
292069
860187
476072
957532
573501
784633
115099
559374
186967
311623
857614
1046855
1081602
969646
1279553
714049
496360
239475
430449
572158
631656
1106223
1017785
255746
690683
999268
136983
32367
1036899
668915
31221
719153
284662
318877
727692
703758
1049849
928793
567328
239980
1090927
1186186
482222
1174295
871922
1049489
494399
620006
77974
998542
1208209
1239299
684412
1103278
1089193
705455
809282
214374
172245
455411
1016561
1144083
35898
1159292
382654
758307
282401
1040597
967323
250108
1165874
1084619
1184785
639032
163293
1174100
867960
720716
799936
1081156
741019
435296
1099003
903926
339663
578574
707609
168361
129880
1102471
170222
1169765
70969
1130105
971753
120183
205030
222132
167637
474977
487017
117286
180366
993123
144960
934652
1201816
1067213
731348
37111
567111
369419
854900
878885
498831
143900
515511
1168093
303884
549486
470912
1143306
247069
444230
1183156
997509
870007
1113926
183497
1078313
324555
724980
758180
327600
1055964
1191757
521200
705682
62956
630862
130513
170457
1037629
1036226
67842
396015
1200381
693353
123252
542343
284942
1021560
607043
67042
1142110
227587
490414
355223
958936
383946
842094
615998
1241404
281664
499381
932003
321189
536663
844080
913624
314557
373912
869299
500827
81209
564308
603210
207260
726121
623298
1207551
1089103
997383
160510
154644
56823
434560
485621
358837
1203054
270806
476938
1110762
768576
853273
610630
460450
762110
631047
478919
756688
606558
347147
1182887
596200
1060278
90608
654988
593309
104697
976136
645084
762959
1164329
122440
674504
776198
427400
1225698
643882
867357
173487
295509
1162175
555845
555934
444910
432639
722771
540122
729757
680761
13696
47476
916929
144860
1276067
1206298
335774
771341
528055
876652
842296
956646
969678
871847
967146
456089
794968
339099
700577
245148
357692
314465
829644
274562
332204
206291
51466
1183844
1144549
197981
1006351
1257645
450423
124737
505519
342537
986528
601778
335561
890592
497347
856694
10272
135402
445816
1207115
1007845
491458
199184
739722
1169094
344439
17726
709450
1166229
739312
417929
665988
224011
733415
529711
993990
1113978
377340
131334
3270
903308
183583
441856
1008511
833494
475291
710317
188484
1194978
1055381
479228
353428
603914
1220648
1133426
1093255
817636
774652
608302
71416
905935
138807
984291
1264919
1237891
1270939
798343
640379
330753
761832
388513
780503
1219433
1200438
1034798
628825
881912
499754
446916
1031137
937017
402104
261662
57353
934942
834314
860872
1223977
946190
844469
735317
221597
791789
658054
791233
572848
477062
465701
871268
529474
1138964
304232
1052136
1040493
454692
897805
621035
884465
538310
1015617
512121
379745
820938
39786
1277414
938517
878055
913100
1030990
754660
37174
404013
1154210
43030
339961
1059182
851159
110097
561435
559276
631336
111174
808796
1120052
824970
402882
1219149
763155
32695
178345
772029
836552
483964
701522
376657
349208
1026926
505034
428728
1250387
1138265
566480
1130566
628884
534477
92645
121598
842573
1145298
362247
916401
304190
312181
100927
779311
739350
885997
440377
744864
339439
134614
306865
231523
427384
267299
72063
757606
1123130
1233251
388193
254869
311205
441903
816228
287859
636141
1249227
584177
347367
535372
652663
258491
27079
28376
396966
211309
90968
391450
710162
956426
350592
899786
747452
345063
461210
784661
615476
609895
939619
500099
872910
200172
408904
805296
603625
674677
305490
177367
2362
1186511
893162
537637
336540
339626
946836
999256
530242
580449
315813
1019209
1463
1050649
633194
179282
1045385
261831
332907
759111
991650
1266028
1047754
444619
1178218
755328
269432
681345
376778
124951
1253868
813587
1225601
616516
154067
1268681
931077
873411
1246673
963580
644090
959220
101177
158597
204511
889629
267265
892787
295250
635594
460521
890651
116965
1023847
902101
140727
1271003
199615
415057
276776
1161928
1194310
1194958
1244181
793204
35982
1169989
851667
1043717
36669
1264220
1121449
781552
866615
999061
989660
447859
592075
1008506
1183079
365097
890372
371682
192140
811811
441685
1159671
803040
327869
537624
504841
166894
22232
691063
815530
120108
932550
900047
851215
1100446
287962
895615
1011451
449850
835910
1085019
169679
547781
565596
1132469
722637
361094
880565
1261756
1135891
1218696
776048
683387
74189
796533
685566
664235
283032
960851
683618
703630
403342
1067074
363075
601143
596786
626167
467518
215569
398835
329005
547369
1168099
31166
883389
1256292
14473
386220
110093
819839
1263488
62461
757232
1039124
1022327
536220
1159871
481788
282997
168645
865413
718200
285116
1239128
156120
1132945
81232
195076
996939
533101
742494
219623
1163099
947205
164827
1145517
523939
1133816
19889
671953
854402
71391
946723
560795
900946
149726
909942
335109
1185555
1108583
755440
1061194
1255169
323120
58664
15693
263410
721156
83910
623080
384049
560022
789532
661284
423768
308303
1185736
460164
300255
828588
527832
804824
877572
662466
641418
670900
773696
489818
1276057
828870
66402
481856
837128
528744
1055279
643591
1181911
984211
20830
701244
806672
630224
1221517
201795
875947
945633
1095703
14563
1016373
241223
1163422
103059
569743
472572
303442
107765
824655
278215
591565
1078941
224309
784068
807315
125867
671041
354792
172073
176315
853270
289887
931377
1053989
66401
61233
512512
997478
37364
651521
555892
704500
30025
585243
594088
542877
320151
751738
363211
242299
890139
1021301
319956
911538
309508
1029049
686677
572413
836372
481008
1278728
582838
121433
650080
212097
412627
1180678
711424
911619
930394
73200
167601
292513
454783
541096
915064
670490
632464
227095
1216907
372097
1098003
356291
970989
363239
988368
653828
899594
462449
1011550
499796
304655
1173768
77355
162174
683593
650274
883987
1264655
133069
526810
345329
540762
1166495
661069
1030148
291277
1100071
1162193
256966
600282
214922
84783
703128
53635
723046
123857
781179
403293
211698
489366
1091642
772950
571979
661101
505709
197452
725105
299304
216335
232751
597471
1104431
1106003
451853
655527
862316
852940
255869
1041384
1225244
558317
627874
55182
221398
1258075
216800
171858
253265
431914
1276891
122821
820185
329381
597994
1027928
340833
208821
342238
877008
1220666
136353
1016962
506019
110722
864701
416739
1103271
248712
830071
835341
1274508
1071122
669343
185693
78000
351732
950214
333126
1104924
1029403
1217096
401428
417817
186237
164335
1088163
316188
1261565
1239008
418640
156301
784784
827477
712801
50332
583074
724245
295360
197560
1071449
985747
989985
1082430
865257
223230
880160
672160
495059
354229
1088047
30313
778357
1248053
89251
583884
607733
993440
965896
124412
348953
756927
703887
548922
252185
739982
909299
249118
616382
1240202
316879
419751
515708
25295
485191
428767
691594
1096400
534482
472272
936884
968833
721956
352867
611067
748992
327747
638348
75577
792695
632961
381804
141363
69553
937214
234998
112359
1164352
532553
223007
1145915
813518
509684
801209
1090035
22615
48331
836701
1123811
255022
1079205
786709
999334
171051
935955
216937
600444
940007
851127
390517
503307
863483
598746
534091
164061
1138031
108662
704002
197589
446509
1007453
794708
319108
1212912
680539
122134
535533
39609
661728
96334
865382
129484
671638
582946
455042
680130
873712
572164
892120
75775
245024
223751
940538
881584
181331
1206152
340831
315007
678750
186794
562551
371569
69791
940279
168823
379123
36415
442613
1109993
405332
4421
170132
922955
744985
876396
782980
52101
3993
44239
973255
137614
301853
127396
832685
156375
966945
1172569
932321
854892
640319
1012884
1235897
737097
938102
1156932
646557
887619
683039
118736
1128787
1057857
437600
704525
649494
1181221
134921
827694
1110480
536408
1011831
1230143
310247
913978
701405
671870
829512
829397
1136367
924218
544766
1203096
751317
73626
936472
958480
769216
543802
113586
504633
994120
245364
675886
197315
143719
1255766
1017042
1035758
388846
207917
1078985
129621
429463
1247260
67918
810910
438332
237288
106499
873891
540433
764211
452547
576849
747908
23884
912443
1123785
764289
997896
794373
259655
95770
156226
245796
1075937
1085436
1046755
879808
1279911
14689
745977
1244228
1039233
762215
271002
1229942
347184
119136
1185650
1136833
1042339
755537
317681
241046
1091450
1014784
834362
284620
363475
1021043
1177353
1021734
1246125
213948
1008911
540066
725712
457864
1024644
792449
342615
161739
596295
892537
1205855
1129146
988372
116294
384444
1013869
119494
168509
482
1145426
1068197
1141527
178072
1124785
771652
1000689
1218617
315617
851979
165674
802760
859418
1050365
158527
919027
391853
639087
450203
392388
1720
641160
68456
236469
263011
538103
672403
1140559
575881
625314
728036
130861
1065706
425441
257880
694084
521962
1150109
1079644
1247091
1272750
1191821
675379
910038
634233
917361
220790
311096
629301
770563
640169
614578
685305
576050
553278
885013
1154315
355197
109710
361635
480675
1211252
325573
257249
606861
1155526
1125395
1137821
73527
280028
215352
1047461
1023383
1227449
704989
1050757
542932
1163645
828458
145874
300021
395347
394145
792531
420800
589605
953207
92036
762721
1137667
25602
509309
225354
211939
382751
595079
735363
729882
434976
168739
256081
1211512
93350
114252
6731
1167341
1009034
651408
767308
742372
556839
400326
1166756
897824
337086
391308
356544
563958
1183060
663281
810908
903358
629993
417115
869055
586617
324147
783955
1276443
1038688
650959
459957
440616
2817
49554
669838
712459
767796
283247
540084
1188161
913420
809589
633843
1149905
1277128
1099303
1115299
1240703
756
318054
262865
74478
1040756
110636
194491
268236
599753
1224329
581669
1066184
1086755
955198
698148
1103617
1214364
328275
1227808
928195
23179
533586
589915
874965
657895
501114
1104468
910743
16338
1225363
676468
700110
15786
1138402
766402
578234
185724
648858
1234106
854314
981580
997858
33882
1040007
572118
36347
1032820
85238
524038
1202089
629635
844635
1203055
635198
407868
168809
1030618
900511
1201868
666027
74917
462633
75987
855589
284297
133787
1111418
580797
893673
642436
1104252
869921
1263538
616174
200341
896317
1183752
23244
1263370
1265503
849394
902752
196398
576020
1251838
498353
708316
923254
996178
1244371
272176
315717
962469
107126
47089
1189461
1262603
276717
1145108
718515
138056
818285
1246475
143392
295550
15470
1152692
481732
611763
1248352
22978
394519
895325
811017
722574
215853
1230807
327585
91328
834835
372423
549039
942276
32603
71856
766944
429461
975879
55510
425572
567968
816071
627482
770202
30028
450914
291345
926364
1052911
1224832
831688
945087
1258024
1224183
678595
783888
472503
418646
394039
648736
275286
1131998
955970
946272
32321
970351
1227153
721005
564290
894047
1043767
15426
378718
64320
1144248
574269
992542
56178
1205569
426642
835965
1248219
141446
992517
1033574
809239
217877
600773
1053541
1034219
892867
1068995
614584
633636
961070
361013
94596
946928
339875
188565
353464
499395
84702
541775
626362
411379
67751
72855
1199616
633214
28521
1152981
152405
181648
670059
202007
1086849
816095
76917
432398
456610
829176
25701
629942
828822
143291
792491
165403
1273947
655269
1082652
1008064
1007621
551659
61784
162836
921158
33272
1026048
319577
277539
74532
318325
812030
1178386
502247
155346
906650
1278174
68893
810584
588456
682578
647590
498675
766876
1213727
982056
286866
928009
317270
906567
1066764
463464
189964
723623
889278
1250880
918637
991656
755700
1109078
104497
266979
992041
774306
906228
623640
118395
1216809
1223880
573357
1078738
161847
804829
1030448
244160
858202
122315
565737
966354
390654
419808
566321
93422
3267
708887
518225
323735
326662
1141785
246603
30421
515618
287466
15633
1058331
648838
1035579
873597
937557
682131
579367
9743
1274022
582158
76480
459513
360012
1086141
82356
575025
712508
1415
387346
988603
1199660
1144229
228745
29708
1062794
598197
967990
510615
1143732
697890
142785
19296
993487
397864
407126
1078349
638751
550849
330614
42437
668407
164644
1129801
1139508
235056
427495
199739
718318
241796
1024133
408822
745083
589716
612177
1145022
731226
1058495
1246824
946403
275198
892912
1132995
365351
68188
77528
529487
557980
740061
595512
653781
633739
943785
567534
639111
1097566
778945
1077780
465801
350934
699807
734532
1022592
139097
980639
1155233
970884
1228717
809763
1261284
1221597
1224651
1143606
249227
406456
1094300
548556
866996
22687
228744
841138
388534
674765
15097
226929
365844
39057
330462
179892
1120376
339447
1059497
315776
1106944
285031
891361
28033
224488
408767
1106766
168836
501279
741664
564774
197133
910725
556706
810145
532069
531308
881094
498704
701322
1194337
38225
452379
1022565
17509
697960
1072981
391197
19211
1130448
1165352
471796
685891
1248987
524801
104948
27234
52949
61127
253899
1177169
581556
522637
144409
622137
959162
1098374
325005
395640
50116
205325
1232855
1116150
1265402
28865
1046538
1081984
508391
546966
1261338
670265
123949
990650
562674
652748
1073308
1179222
524597
524752
814082
587010
347465
1104683
467191
598712
713832
60803
671437
484130
618956
1198852
592275
1090822
435308
718573
537741
463553
387094
1075884
455301
1043475
23276
743413
1113583
211961
1156847
976922
1144462
901591
80961
797834
682543
517192
806758
997816
953350
892750
1206944
839609
252450
1077892
631516
128832
555909
412416
1048718
1086598
984740
610077
616437
286696
1190138
529460
302971
732477
1070739
717910
360912
150199
853302
347693
560902
524015
337412
864206
610293
814168
776475
375297
64712
134375
439735
279541
1206068
681998
506451
880120
1206691
1030675
707433
487629
659798
399003
848172
969254
1266068
403475
311576
844944
1167128
587159
460602
473474
34286
45394
444363
1174304
13267
1013076
639183
588758
10227
1087149
885546
431055
1014647
391241
274786
789886
850716
1022921
1271738
1144329
902125
71062
77758
842708
655904
1116947
767650
649113
924165
198687
578286
1202950
955429
932383
690423
1012935
500414
361704
1168203
895651
381323
500878
389738
881651
1186481
441924
258246
598086
596851
1080044
1264555
593632
338150
1184845
872572
205394
828617
780231
747907
1268099
156758
1065295
766837
515866
247452
701859
1041306
1145994
335546
250471
590843
710928
29213
303037
870555
742170
595889
335240
878317
1196711
245318
1068701
289990
875376
421221
516885
641016
215028
543632
503987
673779
580723
1224521
384195
683459
1155046
570335
219380
1229988
729417
470106
413571
396967
652662
619073
179046
272642
734159
313966
102761
285440
1161298
1220505
733984
953556
1200856
18866
349889
496047
85417
1003572
376287
967794
1095631
727264
459434
957644
1120222
1254492
671896
883243
689050
1152127
39404
957190
30772
432704
412927
440327
934334
811868
545415
1093581
735646
517299
997200
482788
874335
638371
292449
421255
1076509
1230577
1142376
1012124
884398
1192979
651037
1243354
220674
890435
160945
1167169
996758
1183034
861166
884662
746911
896203
861964
682750
353275
929566
725735
484660
1130972
837650
620025
944543
686326
25065
888872
1247028
981399
346592
412698
811730
138846
1249293
1177887
875248
836788
568498
1001462
179035
689673
648323
650729
366815
1228309
854531
949376
336090
891357
377789
1248756
552873
881822
1134161
1031798
1169263
375138
73431
553860
655073
1104579
908039
542895
1027064
377544
62127
1089102
721552
504945
25793
709406
411636
200412
801342
667093
1080060
1087307
709240
1223418
716945
245672
1044116
444461
989062
739252
621587
679297
1017085
522798
102015
709065
708767
489776
403025
283920
363096
714177
436803
645981
375287
850496
204406
64826
997075
745271
1097430
1218373
796327
581934
526421
114722
446383
1219289
160229
858392
620298
143726
644257
998569
940037
628166
200158
756414
457315
405209
981261
9195
787353
909720
177114
305692
586112
262051
911648
818450
131239
288285
699349
573533
492230
440936
725529
254136
633727
1274989
463104
1040762
627925
804085
1044661
358992
783554
585925
594541
699544
561243
612983
1250799
315222
548013
589427
946668
1065433
1019679
34244
712348
869475
586821
132581
84317
36581
862818
1189720
1229696
1144700
712477
1186252
393946
20381
758449
1200163
903146
239031
757032
722028
153130
822938
746999
1004241
625685
886988
669103
1202404
557211
65847
1119608
819105
533922
92509
774479
432638
987547
717012
1222712
268996
148604
766676
477881
140579
301812
368564
168596
739282
453447
677689
484486
509646
1038219
531815
1098097
1167598
459319
380849
1273824
9522
918378
693143
331696
295936
462211
339242
1058655
86091
659826
716995
687476
90186
216361
1084657
1263096
168497
644135
62096
744091
608873
725589
166871
1071755
1016086
1171644
528753
403209
126640
1123372
1210357
746925
1273987
241630
1224277
61702
81645
277337
209353
1128638
1008399
747032
546511
483047
1073569
555752
199206
64765
522837
1233785
87399
574963
1273864
985579
609543
1143637
962335
123220
384161
603513
1223608
860193
1101881
923160
725991
1100569
184053
350871
1026408
909929
287837
936896
292188
527546
1207603
778352
1200887
835662
1169160
798794
559226
552458
919602
1057658
107761
1006541
1261951
496183
975348
136689
234877
1257018
1220108
782245
157809
23115
650761
351622
212471
374940
17289
551014
937124
13888
1140792
1027508
1117153
818662
219892
996481
498657
104316
1062710
1032324
1216291
182613
875308
400896
84852
529987
97626
640042
825465
920226
489483
580650
742442
164844
564499
277073
640331
594554
685617
323035
281596
667206
120353
644159
93137
167524
1008669
201111
39993
949583
1261373
647794
574304
842331
524144
301424
677531
1275159
68028
704538
197747
578989
292399
1198574
932553
24906
166570
1245953
1174946
568766
415186
88829
572957
363943
464699
1160360
884583
435513
965960
901918
1212713
1108394
108694
22453
2502
663874
1242196
409584
504403
487368
542150
314794
1199251
1227021
611102
727630
655630
1154923
196229
1083165
1077452
727484
454732
603124
718114
1157303
1133502
1217405
171957
575236
1165560
278470
766377
711031
1171427
46182
1017131
587682
934864
447018
641530
264770
413816
151062
1238412
465984
739182
466930
843894
99462
2898
1018287
287333
598513
827382
1004749
166163
266329
694752
620430
253391
1202842
1260574
757087
734649
895184
1211393
498213
427020
672898
1010732
1027407
1157836
1137422
402736
272420
745772
1128208
1170550
580599
694967
304031
1276760
994796
964016
1237098
926287
1255353
296902
625377
280391
472674
711508
1107237
846493
490238
621808
954588
1030185
1069942
189085
232796
1028607
1261245
1141390
520540
798192
580796
1093494
1003108
107079
294443
2715
515118
428898
591607
587054
1003368
1035822
657310
655968
688413
632132
837851
426004
548020
634938
749894
324375
539176
1128915
941595
780381
1007791
209234
386025
10612
229440
364018
661709
307014
870975
500144
24103
279500
342618
1208604
708701
357606
356475
280791
279082
916532
427860
488010
1140211
296002
372250
1216339
17534
1193356
144009
506740
865893
34036
1039740
210587
580683
867769
68340
1091307
380455
855130
95240
181423
516950
935295
1211064
968646
36903
417699
55910
980508
522185
117724
266146
415286
734842
229454
130470
986264
33318
924651
1167165
640316
1143304
686380
645799
349918
365426
753248
385660
1053743
429905
160822
1253391
955430
1155112
817493
234887
942587
353830
136728
759289
105064
1171648
696616
997072
1111100
538385
831803
448041
909867
1009952
512565
572524
669983
275523
1126535
1274817
1276382
1130422
786195
866172
79945
977706
1093079
94121
988520
1107232
1056611
1083549
1048806
1260000
841249
1277167
1275166
1087910
800900
687706
1150310
1258374
408789
246489
970316
1181006
524687
400152
696760
374257
795224
19968
1086036
1006684
766785
885233
263668
1083300
926420
317335
1036667
38588
1154782
888415
1106447
3524
706077
977018
382423
1205056
809235
1108207
389154
766694
1120858
502881
382202
872338
116391
1149745
809984
1268306
1035143
975462
946505
146211
309647
456159
566045
545637
409273
332675
156269
1237923
469825
730749
349185
327189
393681
301408
986288
74050
1182110
29527
483777
128621
210847
1221192
168669
663434
712309
652530
502916
292146
503008
514654
526941
641541
134469
902345
129223
850539
1234563
821234
979724
185835
681087
656254
890095
309295
363072
11859
478988
444418
1042885
177419
1062690
821500
1211570
1257169
50501
1041721
1080833
123380
1031350
1054109
904549
600285
631135
1055931
1026773
322329
976771
1276221
911765
1087550
81521
348887
238435
918037
367810
1274250
829547
637611
101819
1079135
827299
1104727
887376
868458
195592
179132
509033
292136
1015723
1186367
896416
993393
938701
629346
501637
1179649
218677
1051580
128969
1162834
1056501
498336
588375
1216246
237507
425642
1165561
458187
320900
110468
958510
953803
115245
211780
490308
209709
21761
522780
1271921
1185824
84843
795221
42262
235933
193895
1084395
1009783
101018
745389
185215
1034117
531919
1124505
1093446
1222549
289848
102703
914325
1242900
1204726
594908
909924
744404
886054
1149667
139963
233960
540674
905816
137905
1203106
908027
554064
69671
573000
901312
595204
863285
409200
1153403
142548
445824
1277545
32701
934335
885787
754713
1039089
45466
1024529
611204
567557
840005
785594
541249
1196862
58397
382939
1041630
797635
1247427
323373
185796
1246889
818511
1134396
853125
249604
158839
71744
1110801
1057079
205198
923405
171565
758118
200726
492387
685790
783208
1277436
609418
1031035
413226
117794
831213
109607
64576
921338
1112259
762326
275791
316549
225697
446968
799821
593826
721645
577265
632991
654857
255609
538490
590279
494643
466586
60373
228377
884773
365113
186368
119061
1099471
617900
238985
1164522
509542
426759
593018
299830
756631
443256
776506
1188026
85291
244591
460316
1254683
519332
925588
701564
502089
235679
272881
1033328
207139
168323
577544
819072
329777
655252
863478
713953
587410
416527
170815
963910
145551
527784
916759
628073
277413
1223407
913034
520541
293197
278803
690594
499991
434494
1148683
997804
47386
197352
628855
208234
513643
402447
713997
243657
595347
1010709
981660
199399
519006
644373
1117500
582078
279947
696279
654028
632469
626980
560211
260521
514310
325328
1032678
1030595
899025
149084
580398
206049
1275087
653129
1066112
837722
665041
826241
942845
1107776
512776
1103519
11325
473324
549457
208508
325874
941795
415509
20524
1184511
678887
526580
1272152
1121503
1003263
144242
510945
550729
205193
658603
725337
1094181
392755
315320
893369
819763
786598
337969
1037139
111203
802182
160052
235390
698346
833637
545822
698703
30255
1276771
1053722
148570
9621
1184507
139979
1226061
1148491
553133
253973
1014410
1164523
470410
575979
169561
338651
802064
677759
556173
1107079
956350
1172762
316553
1146983
387936
723589
493432
1203908
39729
937491
709694
219290
306383
774969
548887
872389
1254863
878974
551971
111506
1072533
143152
380108
100673
336512
889745
1061480
831450
408278
560703
1132714
1052455
591592
1246567
694453
603858
1171164
264310
395679
873870
838836
922557
882129
591818
1201896
910674
1095245
1165633
1002922
941018
361755
404035
698756
1188360
379041
73988
1123030
955750
1239444
731829
568069
791406
355750
121760
672728
447288
123275
661499
175155
484994
175777
840368
1233578
156155
1017655
1011563
231261
1116227
1173281
40907
1000749
895137
21280
689839
531209
357843
1042967
635807
1160453
1106720
1217876
1132270
564417
261821
1042391
1235778
467498
841456
855505
1058250
111943
494530
1172771
847264
995886
560763
977984
1275308
670372
790374
741232
306047
141618
1155230
82685
659239
1109909
1128551
1159483
949239
286627
305125
171117
360200
330001
254694
143681
302484
414345
432792
324960
903379
359310
517813
706396
27273
1014445
1067549
211581
953119
532903
1055536
575801
12949
18986
321016
113855
596839
643637
279497
369437
834959
599553
869910
67777
554697
72108
720763
653786
578608
480592
98607
619188
988259
756600
707842
520375
1085093
224931
239306
73530
390547
808914
1022653
1182324
544043
940567
52134
748654
503749
162786
921233
74213
1279019
761045
273037
160473
500868
891899
789640
42889
598834
1080118
197430
100245
669268
900812
1141012
751191
282937
1109
51740
284011
543664
464475
319081
202431
8193
844567
1084681
400153
989283
290881
38044
1053325
748152
1157754
616865
292803
731263
1277467
833383
314587
4384
995551
1222595
725578
61566
201454
797736
716123
487054
659337
856908
1004561
982925
878298
1222902
664009
1232941
157246
249484
691876
253814
46926
356959
838126
56136
279092
651707
1009711
311500
804249
1040016
15176
375505
1159516
1095907
739817
443922
1121162
639030
87557
62173
236029
967399
1096085
297573
146924
1176310
1265881
736434
146508
486341
25758
300745
615325
905651
334232
80844
698298
1080558
660832
959906
358905
1114410
228624
1201424
845914
1053528
690555
849355
728345
2866
702852
1145923
658089
81703
1178061
198576
524390
442802
410150
1253519
954558
851985
141691
1268203
779544
549242
716506
418015
915741
628428
792254
578578
913750
78041
630833
463731
915953
1187257
782802
507500
499746
1168173
1144441
852308
454650
460259
389619
911555
632645
483996
1036982
893030
50375
605138
1025407
1263356
1020553
754816
1211049
1168562
391600
1223312
607955
297300
756036
826793
228692
332015
608680
65481
332924
409725
1182967
1212792
1213622
803648
635463
675804
1084933
73330
907395
194410
1094559
676329
513330
34491
1092060
250591
257886
977815
512534
345730
204083
1113927
382529
1129585
1015884
290161
894027
1151424
652959
864713
1081003
646861
780317
457812
700171
337013
885480
933679
1004141
446588
508630
897575
105540
252773
4016
254383
654092
175422
342984
629857
899541
732800
1117411
731138
102473
1226548
141310
385002
681431
584950
103280
635688
476239
422402
1155144
349328
1248587
78926
552102
1264532
1255680
452238
979728
420756
365692
399130
951277
127346
1158367
1030166
1044503
609423
651396
256957
736982
64545
623470
1220622
444386
216778
913852
206641
616943
467141
1199114
984087
530488
961871
32451
342753
907063
599367
440472
269994
1148754
1090666
743842
1043154
364622
924550
850157
1069566
424699
346050
200194
10049
421069
147032
1124336
807433
70262
3360
487878
564968
539242
552371
32489
427054
89286
856415
936705
1259498
486367
97960
921716
652153
1072060
376207
630333
37578
787174
758877
764659
495114
1152207
972485
1072338
206760
811598
106271
1116326
229506
1183251
1058784
793066
1051512
930432
676147
377135
181177
216690
345160
767454
918956
1201417
1138843
187442
538798
9751
374538
95125
191624
263784
886285
1235717
698724
1198765
1050405
1192629
1007433
287100
1230718
686925
1005220
948820
942375
1152462
30338
188893
337142
822499
989869
559556
691862
719753
1253101
578285
988076
638121
428900
163808
1072452
1099458
1223229
865605
254220
461190
553596
625698
178851
934700
107419
949446
402462
1030152
1029943
561604
387568
347230
122281
514450
791799
1052863
64135
327960
387776
536948
1259302
821287
579698
802210
1059117
332986
148126
172768
1243238
914088
187096
827135
972573
1079204
524229
460114
1150383
403873
288997
749787
203265
1206315
357429
1121283
1162069
536487
876434
331243
888995
186365
849786
1258210
1232773
571428
42806
1087231
591860
930249
1219922
946563
738182
1019046
732536
579131
94983
75074
965460
767716
73253
1174573
812673
1048388
394719
348020
539289
1096001
422739
526518
945328
254752
267372
20613
936960
505258
1002559
1257512
173767
1142282
1072021
26550
1016321
1129124
623591
811139
392487
239263
216715
232029
766136
635374
244734
435020
933299
763350
1264161
884775
1054277
630422
256543
699824
143572
245947
1108689
1219652
162005
86016
121403
1058215
815142
243265
305907
951883
343880
162354
495779
750493
569824
822226
466818
601872
505011
1076812
654678
1209662
103066
1220856
39571
973172
517122
555624
364292
1081501
337252
157220
605714
397205
1096643
487911
488715
50823
386353
567278
253135
1231612
385090
1220380
304364
757279
316127
145782
263599
162421
259086
582527
735176
636431
1167423
851079
548204
930885
396043
574186
104547
1015917
1005538
933877
1073671
361319
222857
931707
977630
406010
928484
1102686
536473
1068928
784443
1043744
245320
281572
214000
1279803
347811
286741
923923
838414
1041621
1055795
75368
1129074
60639
1091617
429254
556674
997360
577949
909130
139233
440451
1063938
163157
375397
726097
645827
1144967
23072
676639
30551
831187
1254455
682059
8807
212324
187057
1171557
135422
158780
358248
1188648
359888
1140231
466178
1098027
493514
205870
1089309
669044
723482
716016
1150879
84912
1127758
711190
742495
418700
817267
1243617
154784
1070469
1216117
6940
877591
4655
574107
986742
1131467
1125124
649253
660272
496452
1173910
577435
842301
1237597
77807
1260583
124403
886815
476165
352863
18698
995087
627691
1093101
984941
927273
1108407
1184245
1025549
1147182
824448
637659
1089056
1004314
558753
626203
479495
659590
175715
1256718
951921
778061
62764
755529
1023866
247556
467239
175607
726711
317119
646588
900016
439772
924585
419455
311657
59633
956481
663072
519230
735262
521822
1084574
1055047
1250950
197874
381075
675436
1006206
1100184
152919
1086206
513713
1086800
1252380
184827
646418
1252273
208626
189334
707149
618373
1054668
1060520
205059
696232
200049
937116
568896
139013
907697
726931
1164792
114428
227714
1064266
1226881
534029
1116699
406268
8898
444033
1023744
459782
1037464
99989
168036
989610
117677
656172
145592
848687
979177
537789
285218
529651
351981
648416
270255
640096
747344
691357
449001
1161180
697296
788635
1093596
1214776
1074986
1181205
483345
732486
772683
732929
142678
1133414
1057013
354611
587305
929048
417587
186939
833015
641116
905636
1107889
20353
724878
1053786
208124
701841
233427
942156
1256917
166812
1205950
567922
1124062
364021
222271
99113
997035
865696
197522
1192252
471243
1249687
60113
463053
146595
20488
541309
1207388
712596
24794
1058294
88545
758539
535739
701657
282752
111016
228290
61630
847992
288425
1079944
677230
1154129
133661
214842
1099610
96965
451455
684731
674643
1008142
1242625
604074
367317
88866
458539
623419
698551
23166
816802
240734
830713
471027
310616
366769
80383
1278327
478822
1038134
682916
726957
439558
786445
771088
502431
312138
741231
407679
811963
477372
160049
165913
892978
713505
899878
485893
424404
961900
1261670
199204
254839
106881
983523
444188
534041
630367
1033533
622801
292164
989305
193553
148104
1017558
657533
668926
678880
261039
418255
775939
1047872
656444
1126881
817575
606926
193395
921571
657845
1178764
1132648
212693
229887
976287
1172035
920842
122014
94339
295722
107626
629984
222871
652323
128144
577064
104592
518105
1212050
901288
373134
1257318
1277401
677143
1069392
260752
385768
1102021
1223814
256897
1085723
406348
547237
1230590
32053
90047
884901
238645
446995
266915
456723
1110522
491392
1189969
1095794
1036713
1030431
787993
632435
494369
526005
924766
1098359
1166202
190899
1069999
381678
751935
657247
148856
29186
655887
1246157
1195383
1069378
488822
303901
534279
62641
427500
504677
548669
752194
1213013
59617
951909
37039
960792
284916
918311
580401
749221
1214229
199944
22492
978866
880366
1089746
1035428
268877
12367
700790
1153227
884902
788878
1177064
181075
834896
162395
570391
46145
1155640
1194500
391494
607526
728748
470749
809017
93033
172815
731319
31936
639758
181350
999277
643892
901490
751299
1275479
963010
1149620
1259443
629392
57359
629728
706319
758814
210823
117676
425530
922925
1221852
750243
835617
22798
450984
753645
462978
48483
156567
44776
928209
693286
1000992
166562
222293
1040537
23744
174847
958533
259636
660208
491595
8283
1184456
296447
142001
565028
859589
179021
625199
1251848
409881
227745
773814
276570
964573
838039
639337
313897
409302
105180
38096
104251
221791
990716
554669
336024
199163
113964
745423
90772
823058
1044198
1106263
1027918
205197
859647
570701
354476
739992
783064
963850
581288
889560
1255691
389150
798337
850840
328502
332240
140135
103034
1255088
1266027
1146551
833038
254769
267684
934533
1013965
719281
1090682
606520
669847
392435
1157795
334774
619593
451872
571193
429881
737906
100184
433284
477347
1130682
645266
578371
407475
516125
601995
802000
667151
423170
269229
1271060
737917
904087
207004
710976
1021204
132777
871100
89948
589803
209279
96487
811270
314807
555109
941222
1093326
854516
794477
1084951
1237201
193033
177284
1060615
576729
696566
953861
735210
104319
1149815
1259172
1173638
197078
382326
754591
891519
1021701
1068152
586950
247938
1026987
1175125
79867
353601
192303
1066674
1211197
652346
1004831
1075232
973858
888585
1136630
1025233
196706
915927
411913
939075
915566
294048
636053
966363
815055
197428
389743
1086093
293300
372696
275760
885778
339795
670376
242334
1119749
88766
947216
29236
864881
918029
1173514
791329
694598
892961
965073
442644
907981
658033
259724
1085122
328993
1198911
613731
199684
512788
696716
1270646
652361
34882
724882
148002
365817
48019
808948
830223
137158
541051
529772
705127
1035962
373007
141711
400708
1239626
115400
856647
159599
22679
1260803
998706
488610
1279925
1269546
544440
1058305
1134280
965410
371636
301179
941797
507722
548671
11862
1269564
766310
108260
101666
761424
352834
4269
454350
70773
531673
915080
983955
375954
716034
681717
798552
715499
827111
784650
809138
1168202
1256953
257485
741861
1248005
1013893
812314
309837
327506
594118
196211
488850
156583
975784
270446
1186000
507586
314394
1106177
738477
991016
908157
512743
80286
1262235
855070
797377
421724
1170234
480549
450923
517333
990698
186733
1166365
551806
1164238
831396
496414
1201924
721858
65065
462273
507760
1278148
1231759
547213
132267
