<PAD>
520477
816903
1033823
995362
920327
834740
460600
54111
1226448
1025743
990423
526298
766772
441513
655201
930754
300241
477703
596474
133940
701424
422098
1071452
1163183
325497
490774
487337
876555
490535
1134165
1253787
1019141
1080587
553856
39765
166959
105283
323159
572782
49805
63641
598948
1275770
454003
1091199
966562
235896
918835
541144
386932
1115586
554251
1121767
1207796
138140
404543
658131
792049
355504
129533
608182
889228
19054
99203
824446
739365
426716
1097342
340401
98991
599826
941047
857269
848000
956848
965936
878073
1061507
290352
655002
796858
403305
1000483
844647
184574
1224594
31046
411707
1181092
1267351
752874
1257015
784356
524739
726082
201789
560534
967191
663450
335962
605692
874881
806785
1190978
177456
562647
388322
845860
183909
100078
186268
939470
271975
1145236
1097161
847972
1049092
806755
674551
1057544
1154737
1191954
796260
497735
263278
703339
768219
881054
585102
686860
792991
318929
229783
9604
915090
825345
79262
427992
102499
1880
830830
386754
1122314
272665
833357
18911
747560
1058680
1137386
663669
1245422
287496
366191
520355
250930
117367
78141
204775
425511
1134596
3849
325467
414956
102711
628277
680125
764656
457828
652252
96614
573761
361815
813840
1082097
72103
200862
473461
984580
261174
778803
148697
909264
1051868
1000782
762897
566841
788244
669476
1098157
321830
424428
1110074
568277
22666
693588
203167
730920
547191
400027
806803
529032
161601
266784
308610
66721
922318
285591
61571
144973
680091
522428
534086
100833
980337
599962
264512
265771
716116
436553
1149037
1161095
555027
174851
211163
149201
518787
907296
703615
485807
396212
703473
135326
965650
683284
1190676
287730
501768
1025059
444974
481786
783781
744561
479552
343851
490374
175827
796795
407475
539278
1069083
1196999
211511
1089809
196494
1078287
791685
563568
491804
119099
738281
1097942
1038736
1171995
660975
56509
536257
1113110
261940
605219
1105164
1251396
106993
1142192
542816
1258682
1216280
1268082
854891
587327
259154
100382
416085
99575
296734
913250
446961
168220
407662
54885
508008
178725
1003539
203457
947200
1037188
614484
257985
458209
196698
1018377
1063442
700444
203284
718788
292687
1073840
558713
41306
272277
601668
161631
1102131
302854
422170
552368
1040254
713291
810733
608869
661494
864963
740921
1113816
849769
25959
848321
978035
303845
1022460
313684
1081563
829191
66495
251717
426409
1167357
452418
40563
868967
328851
769051
80265
1279716
448557
548903
676782
1119699
201133
1096861
183082
437206
263151
962375
274418
747063
460809
1021911
1203094
346935
1047796
885680
489884
248537
392093
825039
299485
379223
74138
1275969
1252987
1081251
708375
1256802
1194630
715925
679740
157787
25430
1279476
38841
1077959
910697
981354
405680
733085
912033
895011
790149
240714
636415
7796
347900
192454
857131
558281
989485
931304
933445
29487
965957
377764
695445
150836
1253164
1232987
671551
789842
290288
933481
18127
883699
494878
999378
970100
434248
54059
1254728
732050
752991
447420
1046814
309047
228108
461074
1270191
634619
877167
1154287
1128160
83378
243774
1001167
196710
1120734
21772
686820
1051390
773139
819591
525987
312181
520259
591366
894612
482014
863657
1198055
84718
170739
312698
742713
668425
889015
944337
1230376
957974
41607
289763
1141528
1040894
130119
300557
65431
801760
461372
620853
1193939
954801
28008
916947
158677
507321
788176
828892
49671
112533
1257332
482707
1174272
868560
1210589
1003894
1011979
598647
57231
545102
291779
232680
864895
1119801
936318
448837
1194371
955021
273994
896267
133905
546577
520506
700276
632718
220626
758716
372808
1267003
399718
1240749
960860
195057
1067570
684859
569782
5820
132454
169362
8322
948715
1070929
266069
1141728
293941
900216
633039
339472
365158
809940
208979
1272166
991428
1025713
475197
788023
228014
849059
440061
1266317
712636
167073
110130
1232449
693050
859563
154312
216495
432149
14786
718713
183491
799674
363388
132697
67633
245341
53796
487685
1009499
446167
1005033
1130795
939268
1084266
336098
1012629
876606
860053
1128683
81703
1012908
548075
444925
110494
638334
1257748
1183198
723492
1076274
298641
111874
245671
876740
852447
260876
456154
413137
280268
1244596
971799
1031928
437916
16008
643640
983990
824098
186144
40636
897439
821270
115198
1271025
335008
801149
857503
670486
920910
70254
1016192
20619
334227
197012
689292
1167295
428303
652120
457012
685057
498300
1201487
603499
1279582
743458
137035
1017589
622285
7500
377489
535072
157623
583707
1045349
901377
1218708
30306
886244
1155376
508687
718123
347165
299571
148609
64250
820884
659499
626786
428243
593574
808039
209856
467168
1159154
666655
182180
1227586
565958
499112
918956
257811
584131
163931
35579
386394
1140157
728407
661248
310960
986650
1229740
1112347
1099927
232380
85763
437936
361906
527817
655939
1103113
1021248
187793
793858
525772
704151
545370
246539
866576
515948
610495
888947
720101
779436
779802
1264068
218413
1027255
591310
317915
129442
534314
812370
1142343
152088
621682
653874
158164
434875
584273
966866
929897
887156
610955
567232
835740
807357
66512
305209
515268
561904
464339
52857
790045
622073
327773
1006455
317259
569415
408021
409561
303469
352715
1238712
865012
595714
809135
1142270
873962
1227861
933052
881493
42619
101862
600366
527264
48492
774778
702966
463809
1075136
1016854
1062522
870892
1118938
1227562
831037
1105906
270091
1155860
887627
898948
543051
1167358
319071
1098675
19182
1063543
108602
410229
393580
357733
74725
331522
956064
897589
882314
1272472
547155
416932
471784
194388
765839
1229683
912348
1036911
1171578
614857
633818
647702
710409
63920
510429
1212330
397523
319243
360674
416291
508717
1037347
397743
1246891
101153
25690
120819
416100
1112816
389822
1143195
892940
1233237
873742
1093951
1040693
171409
680465
210662
984322
901492
132364
242626
1105940
912149
1041576
521125
741559
449130
918421
1144187
663559
850032
337842
247991
572824
713359
45002
752790
482411
37748
1108767
431249
139132
754124
566120
1028317
1272277
2214
716297
50182
371600
92953
755820
1074082
429303
460983
960230
321972
655828
901629
402361
845405
649861
63058
1181454
142160
1008883
269018
47305
372478
124777
862083
382421
1157817
806905
224294
519665
194441
223956
853602
518130
988775
998534
56884
469755
563598
1054199
745799
890928
765514
214186
514147
897471
351343
329790
1150650
1018503
1278146
486973
92740
1264372
491055
200832
630973
188650
620026
139754
780468
610577
424161
6562
1183294
12453
715598
243901
1094941
814731
626603
278563
685593
1234307
970739
756099
444510
1224379
1011466
273264
149458
501973
1053965
64381
146389
423541
729202
935857
1272567
576250
266576
984673
943469
23651
797586
1102102
684484
576563
87727
729468
211393
507248
1084243
108492
712778
568276
250170
886801
194731
729976
892932
833984
933482
1177482
1197475
895109
62931
970106
28028
413171
522362
952474
520261
1057688
164819
496803
508090
1156796
1081302
1233500
1269513
1060995
655756
218198
380521
736115
682413
748896
676899
450633
289039
355924
1276397
485614
643062
398816
1242743
758923
766019
1109510
955619
559981
183248
1228539
996399
1266986
513416
258218
1074421
654705
774502
1107357
29462
677507
1198295
684875
638699
1036901
811205
1108311
444135
897101
368574
146282
1127790
549047
174938
229095
723244
908963
1234416
124774
527096
1194817
659080
1094593
942401
95649
506496
954683
15841
247199
679412
205592
592110
247448
1157718
301998
719949
100089
577712
402432
743490
794043
924874
333771
1124339
692084
956308
551213
863505
1145314
874561
524543
974619
608632
1278895
1189292
719477
1158893
876819
473420
1132635
439809
407991
776990
176383
746402
326432
205839
244780
600200
638160
1128634
354307
373174
16186
1269136
1073687
978327
448558
576097
949409
603094
109974
346125
115869
862457
785738
1010588
795824
1255247
527644
348978
109451
1257817
966953
929269
521598
838395
939594
413404
835649
482080
982084
938853
631506
190067
570889
1171204
357402
1099626
564199
1067170
280002
520601
429547
710059
96086
637864
498826
668068
94449
991219
864651
407290
105678
856297
57163
342914
501987
305212
867238
885827
377843
1019439
1152479
167855
754713
207420
426307
761307
1097425
430399
747180
278602
537723
419650
301918
1252645
279204
57617
367412
494674
777331
566976
1185637
1163907
259975
1147925
1253782
329580
351277
706675
202821
106451
253930
541185
682
737203
1130366
280366
347723
811877
139404
1241862
618531
143205
775644
1190037
69219
753577
1262735
1101781
842907
998350
248026
1196641
114606
706185
76689
437885
901985
28827
143039
386016
858304
235866
921586
668981
851500
1104192
445373
714278
569876
943956
1000015
1042056
161196
1204806
207959
1108771
37007
373367
784490
998233
481058
474807
658346
69046
351127
103087
457738
1009088
349512
122948
615365
620765
1164129
681139
1134471
1207362
253760
1192804
1240790
1237541
1215792
427999
755950
609617
968650
1148025
230580
1146684
585440
1244972
604915
1097155
587594
282245
1212426
353332
474461
1104318
279781
1036907
1051465
518717
1154217
662660
908764
1039033
1224212
588341
1125046
842115
182481
986821
787993
1071566
192091
346422
849885
285480
1194416
157576
818341
900675
162254
26206
1022242
190034
180244
960697
784330
1078721
639400
455719
692492
826538
1032936
572898
47668
1069409
241536
886918
251102
1038656
823858
1023665
652817
425052
252588
999910
194839
436563
274714
584053
45427
193705
655305
465148
1164182
769357
250933
305515
1061562
1135586
938364
384123
97350
89035
947501
290695
1244102
1241179
1038075
509769
960078
114172
631190
613494
209541
84235
352476
1162520
1196847
189764
1041558
330269
333475
141776
113715
65859
828795
632142
292282
437792
452459
389613
457537
12135
1024355
950706
961479
597854
35131
1098258
343688
874391
889545
633284
799164
625639
1268049
233929
1189383
330502
1004932
707872
153183
638682
247854
666233
935975
345921
719711
782716
485399
1037865
653408
1230977
424658
265624
372099
817536
709237
448645
708103
483164
205402
425786
434681
725095
173393
1277871
1102525
60390
768941
10368
212561
778979
84633
845320
153993
1094532
275305
354337
384290
557146
404446
1122544
1212197
506555
632534
1193686
201912
850343
470398
934612
1180130
1092226
1053017
61898
1171209
391494
1180505
952122
42543
260177
460458
1072765
766136
478102
1231567
373093
1130439
408183
1080164
1214182
437672
152938
843088
444545
924462
277558
528760
350771
659038
552213
1093423
154885
606393
1241652
1208289
455592
858946
4987
275242
27356
897436
922653
345864
1147110
525480
222382
153731
1236191
1176494
387150
263400
86697
593092
969064
222851
584919
613280
807057
37356
905055
535448
266887
310106
1213233
909942
450949
226337
655312
464711
235778
1269852
936364
926111
535479
902736
1208415
491188
303011
675745
1204435
311201
257190
133239
308034
821567
796131
293258
910888
857530
1253619
829899
877002
867328
122498
827017
1212070
1167917
521933
246791
791636
1206666
1122693
54244
800095
1119534
254567
1202100
762784
748973
1221286
168106
529018
576500
533560
91044
678048
990139
889841
1098560
897475
131275
1054308
528210
238678
556638
372872
483747
887438
723880
284146
595566
746257
800717
1211157
491781
629837
376996
96705
1062461
1087151
222712
626513
600214
229218
151450
822746
1032916
473974
1016186
42109
584339
925680
289033
806703
18391
927311
923831
1033973
455304
232816
880458
781048
50813
1203883
108791
882127
1006283
500309
22413
102614
141633
857546
989951
33373
556545
567228
617023
1249493
265652
388463
701158
1014945
787270
919096
1264884
821973
977907
877005
603070
819792
496458
934161
988628
132516
783993
428287
663588
335130
42793
433509
1259944
907183
338845
783889
572455
369538
1191387
383832
739201
493451
985047
1244312
657453
651513
182503
635819
437143
1117092
459953
1144244
557617
1099608
1242010
248150
1216951
432191
300235
3146
1096785
535596
1108096
445187
572675
595159
390431
782125
772434
451526
814750
159407
285679
984289
470727
1135617
501257
577019
404914
185123
654946
566228
1271263
57932
58833
1053133
669255
1228370
132419
803346
818896
893034
1053025
138047
822953
245549
908734
1140064
1263122
977873
75094
1275597
303958
400928
199792
118112
831818
671335
1038513
922247
919692
666597
94560
846691
914675
924433
507139
619306
509731
907326
186242
561097
985019
374562
339279
231738
714600
59862
738279
1276065
344718
967715
1208431
781400
1142736
1129308
536072
957148
153705
934197
261549
954499
622292
1136805
16222
575076
1270052
717686
312707
383221
771246
933802
1237177
1226165
843418
311900
1215525
252105
373717
1109881
1045036
264050
270644
311086
756428
796020
780898
234165
274787
1183505
716843
876210
831330
1040672
1107358
1143811
242461
945245
1147263
307483
749188
386190
1104872
398177
32538
604455
1162557
545990
815647
299162
129638
472612
1040914
130684
718574
560195
868273
61530
174161
762310
425328
1211580
1062608
1210198
1259086
809316
189067
1009412
451307
973243
934169
48166
586983
666749
459642
436058
73450
167606
865080
919891
1266863
180603
1249903
1196947
774613
1211274
1201180
536630
1198219
952686
349538
289108
272554
15191
61867
420804
1161631
630580
531723
1016029
648211
1200989
712466
287361
807907
579440
43465
680478
744480
238715
1071880
989940
1137459
484507
1004860
1005148
914065
810179
919707
1010355
572744
1028903
60716
425463
272017
945358
19433
179657
451388
433993
1224786
681465
37754
1105101
463236
628306
245099
463878
30110
318911
253007
1043076
1269938
648226
180992
939417
121732
923112
1234861
940188
212672
802416
527612
709624
554821
561375
730480
711974
341797
266565
44758
1053060
847492
427207
198227
11275
782236
311226
715950
890009
968669
1074748
83442
388567
707520
164293
1191547
1062474
34638
851011
1043187
50399
798252
1140546
821890
608137
885480
40742
226582
425166
46846
1161773
1230878
1189728
422300
639971
725665
746878
856385
439752
23439
1263403
1004279
844029
430687
471876
308655
277492
700659
280239
1049531
590467
720700
492100
65672
1130423
758724
457186
309232
385861
1159540
159720
119390
1138394
918715
196178
25813
329123
1165350
553229
413797
40575
261901
743062
592408
642119
237210
876127
627785
491668
578005
387769
323103
578057
402060
526319
156796
90404
1107420
979335
1175126
715881
1078597
235862
543604
193357
242594
1206153
689346
9815
233053
1101923
803569
431505
173833
1114803
754689
886745
834779
172977
25849
293100
39620
447981
966153
359407
551439
1115197
963529
339212
310464
51846
595929
92927
303134
82600
456364
347414
448845
332979
364245
1060048
273427
247211
632092
444313
117651
75222
12875
639546
49933
1088911
676
192204
165848
645142
1198698
597526
6475
427169
777290
131362
1030575
348277
327386
1097851
279257
970791
447215
617854
351248
289186
1114749
102804
846813
456618
22911
406341
1082045
794790
477290
926600
479860
615898
383151
231649
128104
230865
1034027
548503
1003387
17539
548150
363566
11746
796844
1145276
398887
25402
1063992
575372
1141148
1127672
1228623
294879
396173
772039
742109
735823
768376
1031740
232925
676949
256933
1101945
445334
171962
272272
1029799
411358
1085111
877157
1215074
236744
1138455
986178
35621
26273
140797
471056
914774
680270
145467
861156
129189
886508
832252
371687
472396
933733
357698
256495
419822
512513
660905
922576
1057076
373047
1151409
513274
314275
183732
397207
1248614
851412
593475
382714
1145228
42909
606291
1088438
1087620
289979
176827
1079725
1108721
508037
489614
853904
1085151
1049336
134498
483574
1174448
986276
551650
794821
140591
1081323
1261121
1119636
1258035
997845
391463
577704
1151443
948160
269901
605151
240644
1043366
1075510
288823
988098
91480
301620
1179837
1272826
498864
298572
1144335
1247751
646402
460932
281169
430076
194413
529704
362928
828234
697464
740158
557269
17115
696458
656554
48460
374574
1092157
1265005
457548
834043
818809
794343
1133244
306587
927723
801241
30120
327735
856212
426125
370103
732541
526647
1048411
852638
1244799
572525
366122
1253868
418255
1260150
262022
1105484
191765
152099
899498
75866
448095
1155801
36241
851313
474179
979726
118027
1113703
238510
419842
1166426
81666
927878
35156
1141713
824333
983716
804824
215740
833235
702456
658352
979215
151477
301615
801982
444731
882715
180140
516806
1074337
307886
602389
618722
1213903
8811
129706
203350
596680
68762
927021
1141670
90061
349030
998232
682128
842040
965182
170520
832669
535959
771982
547189
940288
1116679
197563
776603
1256405
1267639
792906
1275937
801289
645524
649968
563972
679169
1175137
597361
372364
1255841
610491
971040
803388
531525
746354
858131
587626
285122
162767
453938
1132828
150200
873149
714782
472421
292979
71997
334143
922826
206375
189927
516703
841481
787329
234386
675505
755521
884963
348412
279976
120326
1231371
1262918
364656
865189
727561
253161
549022
1092604
268041
828333
1120623
1098289
784586
483647
129368
302829
240651
1163783
943761
572333
739181
206819
662080
805056
1030460
305837
171651
528096
375318
546601
75775
283174
960965
335040
154835
823643
295014
82389
560863
533448
106652
1144792
240816
769621
512058
885943
94620
242655
530030
113525
432640
1137305
60376
1043678
144315
716616
1242562
363908
961513
1005934
570381
475681
1052198
383929
781932
397413
309842
266507
928328
960632
541734
1267446
1029949
876870
586511
1071199
955935
323372
300428
270568
287428
269136
820449
966655
330478
1129084
509555
437503
512910
186689
1031246
574154
676351
697412
1032585
680433
286222
772578
873762
1109272
104378
1220910
882843
622070
59282
710842
1264486
301382
626430
712223
690186
497698
1232393
1011229
616471
645357
872285
97356
112529
278094
379921
1009418
1139857
721367
1135491
339233
140908
90319
4184
1024976
508399
32663
52926
515017
807069
240843
943146
357376
522582
289904
594593
653865
495141
1068978
1052956
672904
1164633
627858
152341
1062020
1225399
685384
1170296
467554
497909
1057520
390331
9999
1210003
227822
418676
561265
32804
922853
1026971
58607
484936
301225
577716
62671
388691
253564
1163362
34904
800332
1271195
638932
1242180
796379
736064
1258146
437691
1055875
1169044
1116219
1210440
1113126
855325
748197
1104675
1125005
1079865
1269481
705394
480000
219325
941599
392399
229756
1022491
770015
392505
1110686
865479
433214
464112
967805
1083216
1152192
132767
322986
132826
1204630
603709
1216763
285030
1260924
318273
1177425
1164447
115554
186603
691630
1073196
790876
106568
435479
965683
1234532
1064701
433383
201134
435671
31072
329104
355387
178971
559313
449196
1125911
402043
329963
71823
81658
608977
1260231
152353
813603
390288
174548
1261994
852532
788734
865446
52870
629312
1003767
670921
847166
1106020
40165
317689
1150170
814296
144299
1247029
859432
1242943
670748
409588
574715
365759
577643
430183
264448
744954
1040126
1019695
81939
1180488
538201
784983
1226666
905885
232957
855343
658988
399525
468296
415551
364334
938813
961312
45062
52317
42872
525750
605266
30314
681223
907218
1188445
662160
183717
381185
222258
181793
465675
507470
525024
350146
308554
542187
452121
1236927
1153846
1133703
349742
581481
848512
193331
645718
68270
561734
1181643
652324
335755
64132
854084
619035
196174
624018
1212024
444539
895430
784145
537646
281444
1099624
144803
707612
451648
1055410
276335
752090
213787
22391
656989
275996
274235
1154059
334085
780150
1255308
953010
1260524
1141125
384100
1220858
514343
29514
428234
755505
655971
165511
22395
885069
6333
510564
125939
467042
100727
1116768
1076928
449910
784270
313396
583991
719262
531290
961760
597955
34747
701611
1147549
689410
1184352
212509
157732
1241031
237289
116318
1173687
646051
960662
452935
536993
1028650
491812
846511
85838
478069
157700
996699
175419
353161
754282
555338
248403
509379
577406
1090251
1228199
952151
200579
257914
14572
956511
96599
652270
1278762
766094
244656
736572
1104653
878571
412284
695364
998612
629618
987686
992233
496412
184643
1130055
719519
802461
522421
251013
412075
563297
1070640
104754
1196373
218490
140835
45374
1109210
196123
1156051
852358
876117
1263615
625466
1217886
361534
42955
245286
1208425
713963
887184
289249
353916
1079817
1172271
76154
825261
437867
377877
709401
1171031
1231411
965669
882641
1031755
250535
266169
1227603
71181
688349
1226607
424990
1185190
882159
1072783
524900
607413
1226636
543326
729583
1260052
1217396
929364
101159
1137508
1023345
473664
542613
1223739
403853
334981
803532
510038
606655
303535
1137471
834748
829937
323697
1114958
773288
447658
1270574
115074
1244408
625725
561969
1151792
1622
125749
1170354
571807
1094684
709522
458927
687489
169867
8786
23369
482003
64275
884994
1257367
308520
67965
823026
1145096
1205594
41552
405598
425105
548673
998150
1094395
811684
367145
1222868
562661
948653
1179683
271793
60812
375047
773259
633416
291937
1074380
813061
587064
110135
273817
586506
133700
173979
412711
426521
1189529
1020584
383293
473466
1114428
636918
462569
929135
33753
592784
1200401
597817
340734
1206212
1204906
376795
1026848
102337
1233003
593260
90540
30261
1147766
926728
424136
296503
683991
357242
785678
1032237
250402
713812
955396
739183
724953
1099427
1087783
1012960
181477
1171915
1226754
374759
249694
202208
520767
399118
477373
1270307
153563
748486
539344
290599
763308
413229
1190139
447779
1062736
976063
487725
5800
237180
562116
410100
976009
4187
478989
396595
763514
385066
74184
1198610
793816
990184
1215002
208444
550822
650457
1236159
1076832
184207
567977
975156
1133849
709495
295297
974352
568912
856965
762864
1134055
119406
813992
691032
402918
729761
914216
212302
1130670
1063907
489634
314555
1108321
284282
1048394
797158
1002773
870251
694511
710310
227376
228892
458430
574591
156850
656991
501964
1154937
132406
1233323
86630
97401
417337
36689
492054
789216
771153
362600
866728
554828
1128079
9241
243105
1229467
90518
155653
979177
938682
613610
1029497
189926
797829
459840
763146
343840
720957
979507
734170
118752
446154
1230146
747672
128289
747276
268051
242403
14033
964401
1053441
391840
708231
526989
329415
4846
667738
667265
554976
936468
1088507
48955
561286
1239626
84023
394112
916922
971798
115612
1245640
770212
873180
936608
656243
116344
731793
791344
464039
88139
1112052
590566
860795
1092382
129915
784888
1092066
648429
896354
760809
616518
1231964
958317
455459
275962
156973
322088
926009
1118456
158937
780831
401048
225095
399070
569672
756034
51202
913973
745938
446540
223764
200627
592860
1158981
486222
142079
565585
116197
220238
791992
1196671
1179760
1008501
775454
1023909
47430
1272881
88101
1161722
291276
652296
631992
490923
916261
839255
404010
136078
228401
581925
1194607
430363
357591
561806
132614
755456
471963
828894
152012
479032
629500
1143053
710470
160975
117966
1203227
437702
509760
665739
1096337
691527
386994
1070151
569260
2922
727710
972934
751895
725137
638612
1110927
762977
955607
464952
1128751
866203
560181
1046235
993110
1032942
1159370
688800
743947
1190897
540598
264689
111351
96279
662360
402393
362606
21993
216498
1270495
481372
672751
21168
418411
245507
667940
659374
715815
883131
972785
1156933
844385
389398
690822
758003
778968
633118
238458
869658
727211
235826
193517
122779
163833
56285
487765
1193673
943451
610709
1259733
94281
514156
982129
513143
353706
273491
943960
463280
339946
310848
453992
591503
1016363
661884
945770
1265606
85840
89787
403463
835083
421186
397585
564169
617410
454050
648190
100249
771250
239511
362846
446082
1192036
312961
1061045
271386
952458
93161
1176801
582851
925020
123976
30095
294323
908544
266120
1113583
988942
6127
1237310
1158657
107857
371808
388749
1048677
548245
119159
1186228
762529
834531
612863
1266442
1168761
106492
575189
89919
919484
683625
680227
666782
524138
979268
341766
830039
705603
999154
363810
434185
334179
1048805
31708
356953
468112
400753
791570
29275
930281
604472
1132317
1169032
877469
597031
443635
315205
1209596
68360
1111793
228395
388425
750110
1066453
464268
601035
923659
1184944
354099
652161
1261911
417803
645105
842721
791979
304308
908744
196938
981296
869711
616939
873197
441241
190503
1241158
169438
336946
1204419
438352
349198
751410
166254
901754
1013941
495383
1115844
5805
544010
968444
479062
542417
1020620
178417
739284
328764
746576
530284
983180
863311
222374
250416
680597
534465
734667
644640
901405
89742
1236781
1061622
350172
406894
141631
610356
823493
837510
1806
420428
1235125
31494
346105
927425
813105
722893
1273265
1143533
432219
1243482
1125714
1189113
774527
1253756
1177127
350942
1253228
690574
263348
748006
681612
541877
460864
798390
665460
732777
1074549
1150119
548583
129617
424918
575377
763585
106546
663533
2366
736885
652335
473788
786870
83376
992857
1122710
31749
581424
922802
395112
301026
298775
717399
529873
112926
1229703
628990
508024
1261709
821857
678110
41745
891071
1173623
574613
165674
749822
860009
541521
661871
676040
539564
264476
1114123
161979
944194
459720
731357
416625
69896
188995
832032
28965
614127
985072
435777
831230
611601
669346
193359
1088549
793457
706964
352077
1030307
535403
927957
631533
146341
362844
669224
200184
1198654
395783
249330
989684
1233002
858757
718274
1114818
38724
1155554
324887
1005034
307422
932755
427949
810162
69240
371010
793399
833977
208199
720481
460286
1221320
1020359
424300
966171
1203897
764911
582713
763565
294267
915668
830384
1196855
643944
978326
65726
100421
510707
1151756
893465
707940
257400
145344
85561
780761
345124
611011
952611
125863
106440
411927
65081
126468
774141
916940
527438
1212204
690325
375525
1116206
848042
387525
344254
1046789
970231
1165773
1209309
581936
242084
936291
729183
307924
1199320
372959
200264
366362
261090
158011
739427
439288
197865
1152307
576673
893722
584023
926331
280059
705868
525071
1254469
810004
367432
1158153
540335
645950
1131245
186663
46113
1100548
244131
1217680
916075
128487
946909
58953
1158940
286497
121416
38193
996450
637779
633107
76122
1096410
172922
76179
1163100
505568
576459
747297
928687
1029823
197353
129169
945542
1273058
629248
752575
183528
21542
829988
465381
1040610
36865
1273610
1249101
128690
69340
898853
557089
206141
648465
898058
801867
844509
884859
33145
1196093
185175
171460
637144
535045
1199610
528267
75153
688402
895977
1103154
1194290
154292
808803
1130842
1070989
223602
364472
537341
836256
136494
10242
284323
897181
940104
680533
394761
598635
494157
199958
186301
573629
968113
33233
1136500
155414
91389
481295
435082
152512
35824
233370
843091
397186
921621
101879
669781
778165
7531
1261377
80473
1257067
608519
912910
110488
735900
122513
764798
256512
278629
733224
1221853
571959
589909
1156296
99188
153278
257476
853627
1203090
339959
252779
779932
1240292
734716
390420
1259714
758201
65931
864875
206978
842696
645611
589475
206514
23115
1051086
439942
36800
447038
170682
1019921
1117866
1032284
1015017
477366
831737
110842
607161
1267611
976494
1167949
1246276
1144320
723839
101368
855468
1035734
879063
287290
698094
686688
1070571
335355
831798
480292
24417
658694
355219
999633
604505
646784
1139779
1200054
898029
1183554
713990
1215132
339526
88758
247650
851405
1115787
919060
590000
1049304
982213
1232273
423849
938401
1106130
433364
638224
650949
760515
174620
482085
895573
786610
463371
998175
242799
125988
483444
1103096
150824
331917
1264796
255895
1029118
799764
1083122
991709
329250
678604
1024319
962903
1153449
487352
399293
999176
788510
690621
786257
1262992
526456
1233498
1114540
622646
1000887
846996
1251997
511173
832141
602278
244037
99143
753270
865335
979864
459490
688431
673197
849062
250829
1028709
31086
570914
761476
1269390
1189833
654781
227353
350514
808300
265005
1246136
91501
323033
624645
1205256
246499
960822
560335
388443
251582
403927
739204
944442
630030
602564
129512
1011593
1019003
531635
235082
634627
279465
190007
1202157
829263
1209239
15366
257284
538246
241851
426201
1273249
907424
833445
663597
929644
490093
465575
957199
1267926
54635
696848
273655
674882
228316
117594
225035
69862
795233
387073
1091317
1272886
561394
120247
299592
284990
681823
1001531
676680
102937
309457
33030
292283
1211575
934826
1000890
41876
397210
929579
764706
1059022
157586
1043984
661834
664322
192242
1273285
512031
103547
481077
119448
450154
447309
439185
969219
1198933
210504
556835
782108
830856
804391
130502
415527
821288
764978
1171806
1191834
342847
479307
625597
433243
1116445
102810
696625
624343
226183
358890
1190639
498740
183739
1132327
273852
1221476
39301
1123331
611460
528070
374304
258895
389104
285499
631618
965175
1212698
63616
1254586
55232
768960
101932
56356
48135
517975
1239106
517510
173602
1015084
623036
431944
817337
1159806
954276
1205797
53647
551421
776840
1030897
448755
558841
905064
915103
112209
913015
28881
447179
787717
1106139
14615
608343
283307
786815
1012296
392859
883566
1250556
112825
1019177
1031586
804989
952429
1269562
653617
1102290
647190
273149
534212
1150231
598522
485511
467270
272014
1261539
1205061
552625
736479
585003
563674
181587
190380
585245
255367
666666
478349
431730
507788
412485
376140
725528
397698
325446
841788
1051532
99888
1006797
685272
127479
160033
1267246
907516
841438
288250
271738
81074
697184
1122062
216522
731029
861248
837263
677231
251972
785575
737604
668349
482903
783687
1059648
409467
157191
1131567
937273
1072164
720530
104557
721638
13368
1094895
430269
1142101
605915
1205779
1060323
456065
341963
772824
568722
224483
1173866
1174931
188412
543780
174903
115325
631920
697845
754961
382177
439088
1175212
973620
296381
349143
1136975
344014
975404
407887
284215
677833
31954
598853
1171291
676411
1071548
1119112
15321
449433
875091
23307
583701
694417
376285
1182415
202117
580250
151221
682570
421704
668067
442922
1061761
1080266
124925
1267904
1151191
190292
1138981
960331
759438
491687
694135
696212
7710
600203
338525
720154
533644
710270
721610
273954
1253050
849088
830193
407984
631218
1101552
1107364
452950
220086
124011
409099
231317
351399
837240
716881
1081265
995639
870583
1042173
510692
1171043
445650
1232786
442511
46852
197355
574128
113939
448826
194949
1165775
711049
328266
479611
92861
485677
173599
573290
1219592
1193133
895982
519560
863440
1168071
937107
272605
260763
951180
1098737
1127172
1076766
375328
1146975
309857
839336
330815
226472
11625
579309
882455
829952
1059130
1044661
496316
100765
111925
744551
1196516
456902
507382
783419
570461
512402
1073157
318202
387448
818874
1242737
793572
565130
862240
38274
767155
119114
487838
474642
923927
60978
306502
1230520
546410
283216
1210241
896741
16956
295852
259125
724479
716655
1157478
936198
693789
794144
104211
1198483
1241877
1197785
1080580
582144
1081412
624660
231626
728812
1024365
896869
1020809
476245
1231347
1119628
8344
322356
766042
789365
889573
366221
344770
308111
1148726
292129
25990
675104
1262239
1248399
785527
758477
978329
556788
997278
1161351
1054228
330999
1005385
818228
127596
435420
841002
471832
1237702
1014267
1010400
286292
27652
1267262
885349
237649
472798
168699
1211945
1191594
1276143
1105592
617377
1210067
442435
817893
960360
163634
481903
773910
13185
1043627
1200511
206387
505031
785172
284663
962036
661215
1221324
1030316
101439
1232033
237144
859834
1077694
1018800
438234
1025824
846066
289030
621421
127385
983772
297331
275927
824710
265293
904292
389973
11049
950766
153013
1128577
3109
428044
98951
532865
494484
404285
1015745
456762
453604
528723
1122752
875135
922194
907281
279469
1067203
1069010
271287
863356
1131971
1240138
515379
2281
830766
491362
414858
701193
966237
495762
841363
771566
946811
838119
32173
440630
1235320
12141
602085
95935
438530
935558
752456
976207
1080118
1128239
912564
927365
879803
1079600
405972
65872
583900
478510
1148490
1094435
276560
291741
567448
263832
324005
1162946
62862
1211754
145486
1205026
1191349
996674
1176114
1204737
807560
657527
368422
703374
716317
1199778
223996
990367
640682
773476
722094
983449
1129275
573229
946832
295061
347276
1068641
871121
36066
16419
449171
1008526
245879
541267
513262
495936
1089099
1023383
1166631
406104
277644
534776
748227
991058
623637
132940
668582
436600
1100007
435993
786480
803853
941433
1029186
32102
1196667
224994
1095066
684326
554671
576437
159728
1062139
1016719
192401
964250
1253533
786852
229952
1147124
454275
695297
7166
1026046
276445
959769
105208
949528
632435
1079673
1122629
672444
1200721
1015669
1059576
521590
747011
723404
962757
391007
199162
423871
665901
731253
116086
1012987
915922
1184318
490735
1131493
1187719
691819
424738
550935
759860
351200
1066942
804951
880106
420389
935837
843202
103864
767620
389870
537894
1238242
331607
196095
53535
807640
1039577
582904
200243
1157791
1265984
836943
1016545
717414
950750
740418
1144920
267805
988499
405370
371560
1270563
61223
152146
266164
566385
741241
221743
442950
210562
330004
1029311
394774
503045
369723
1083271
1084125
497051
994494
1197295
19449
842519
825517
698819
1038122
323851
1048301
756801
625947
353277
1171593
1127275
969033
161704
758800
374006
290016
700238
1263258
85600
870828
386947
294540
522292
816422
438312
785457
1201710
368704
347565
1234722
387476
245484
1090154
143579
1194040
926964
602617
374964
1256109
952493
93367
113578
481798
784795
1262732
487547
1102186
1271432
412256
217196
538581
197215
291036
533140
831878
812761
1166015
700073
22959
658134
1275123
558532
482558
1277046
1067219
33633
633868
79177
15401
529344
169917
203751
1175724
1140190
560032
829752
978057
517925
793785
242123
849112
1103363
730666
171721
1188631
578967
751416
1083407
864191
1037912
514320
400296
187723
60726
5695
854247
248920
446205
1039579
946857
375046
1020573
678430
915923
523597
161002
927460
1178538
618907
47261
312260
1213501
1030751
740095
622165
1144975
1229841
337637
814120
1230084
399962
892800
726178
348310
697528
856982
557615
269422
790502
914604
771550
6371
905138
13153
1154162
474487
1195012
336139
126087
264381
889492
1017369
964016
67180
1156271
465506
98515
36072
940716
132361
1243744
801504
891499
1222853
1251812
596439
708033
659286
1250986
828080
1077609
943677
807655
569899
790778
1262880
665799
646523
1022805
333044
1072054
1043709
694888
202557
1054113
445796
1140069
288788
574012
656396
932699
417160
65658
1012597
730415
29964
45883
213166
1054044
528037
912509
70129
1276730
923062
544557
1099511
76581
945556
483285
975720
575338
169620
588997
1036947
524189
1227123
168300
821421
874026
789830
1240168
582314
1222497
351660
90032
70382
426773
585337
26226
265549
977511
980933
1135966
305351
856454
899258
37564
1249042
1191478
377371
422555
1039455
159069
384445
431038
342466
136106
1153444
208042
1064064
181670
562673
500886
137280
1080158
960142
35802
545145
347377
856790
977052
741440
775176
1031677
89691
1276373
357663
910038
302188
546830
393541
309239
255274
716866
119903
1129290
317951
1080870
818330
1214560
488192
89682
1165277
677675
760773
561530
1003883
356948
951903
104032
696150
909614
555314
419839
1142169
333576
151345
369841
237603
172615
727721
281877
781281
573673
41483
1189245
44101
164975
642211
463074
349560
1044675
703648
1196756
452692
702666
1018161
430692
774234
130257
600902
903387
1100805
681700
689304
504991
673921
68797
1141435
966715
941533
747999
359753
507173
341104
240028
236771
116752
113871
37776
788953
819777
263100
463806
792458
913652
971229
169295
361185
560290
244323
1022136
343196
589324
424686
479231
1019466
1264206
1000981
9887
734618
375917
168514
311328
830485
981032
132882
560783
258844
839766
864898
1261613
424348
254270
344346
255023
1061386
699621
56589
467255
964684
42998
549249
611071
8525
398561
1057184
378845
67160
960616
741035
683513
99032
1270901
223379
300361
654530
170538
672268
553806
1090351
530335
916131
1023330
368660
351517
1111926
637579
982822
339518
560618
293935
1250139
944671
245059
911176
738626
858247
836548
348049
569115
958139
31972
334417
1082317
672388
745129
22363
83886
218895
1032491
643302
844540
923770
381752
827565
696384
90355
272959
1131611
950576
1276566
315984
515150
343294
986610
779970
724595
1223572
992670
352566
380773
632285
620291
1132919
115949
889184
862690
83978
1209363
614607
101455
767659
753137
1217375
999918
773248
874098
96438
230051
1014983
410921
526534
339353
335606
275542
1258141
386420
1087918
66918
673550
850916
364763
209786
746375
747488
1101791
582727
379284
128744
425234
903141
544464
1192900
727695
889249
541018
174881
913534
650128
627415
818982
1035081
847112
978427
662620
459698
695382
53297
1010322
744275
91734
135124
101882
441851
654538
736892
667826
756517
631148
303968
767146
429658
947406
571046
66046
753147
967895
1197598
154800
1242000
76491
1258177
1232304
78024
562101
277944
1233952
687536
121301
631411
908651
1255501
667268
1090666
820058
1059520
204601
116226
522518
439635
134532
1218563
60855
679512
1279559
787171
570770
545700
291793
321417
580552
808390
170508
688724
401910
22190
156415
849720
392285
1059625
204976
752894
1054225
530278
1252350
931720
1062958
1062628
53879
1247804
1234450
58305
861408
903795
155750
1108006
70327
821595
387914
454328
415279
1077493
590409
1021630
845138
1173199
574052
907200
715224
868838
1114119
300976
825760
1130368
1055469
544455
250508
989232
464155
13402
383303
427762
615556
248697
9003
654453
378068
1014307
264536
54701
575885
457842
1124729
561409
798574
371224
927672
147390
801563
65951
414910
1233365
81860
665763
1188224
254905
1012323
366387
1247801
957273
928986
17497
339979
495241
451881
383790
536952
856802
165465
87376
898004
615827
200940
1004614
273751
166770
226349
1191481
884640
533449
92121
784191
49628
173887
453340
952205
803971
1182355
248266
1085811
641059
644427
1206903
78153
345154
879691
1079221
955569
561761
322255
30367
733233
1127702
249482
370134
903607
771103
403596
756183
609119
590388
913869
775623
690528
918265
417031
1158078
286293
329061
668442
1254096
906970
460708
103479
1210688
470439
286879
122668
783605
205726
943857
337846
421417
529602
248589
378439
599889
494605
615033
922199
254646
910464
943049
871257
1133779
1197351
775373
888985
315284
1110352
748018
1180951
1075113
1235619
413029
670140
643003
1002233
1234819
245435
959841
580695
38978
652097
270097
1152407
380347
854024
108095
366189
988129
174490
624819
1175362
288694
1083687
13523
237979
1025178
876292
493773
945479
840466
1085802
12479
286752
993668
1203332
227370
502844
1081305
854503
448151
431713
77398
1138570
184659
181901
1203908
335414
883587
115830
658067
1013253
702731
123075
162012
120653
1073849
424096
1028236
522540
350457
334947
877839
652433
119103
732791
997672
458922
298570
128539
556548
416146
759873
395619
312801
310550
1204907
665046
431273
75862
1165537
78392
178772
264082
692149
883354
72726
361777
656755
83098
908264
1087585
47371
682955
300603
791616
439646
501293
806835
1143011
365206
379822
222808
1236697
1070074
889127
1266007
712573
632970
180648
913693
148186
1168938
404995
934229
990364
969248
1195556
314631
54236
1039539
172797
660251
25045
12333
69103
1178937
249837
17989
502466
873018
192388
224317
277849
293958
327948
655138
439312
236999
182330
864525
74375
1123491
893325
169960
850238
631694
1210298
1038474
638528
230614
304353
1058485
678208
171474
1034520
1046871
9568
1226080
776296
1132352
1248405
1242324
593714
696196
87541
988879
140644
1176434
1150772
474544
1189150
348722
525127
914478
655818
139809
295525
485072
875223
800758
564953
507361
165423
11046
1225309
493484
265062
86177
386412
1054439
479248
569796
100264
990623
289301
304205
255319
709144
813749
1012102
146878
420024
487567
319628
24479
1037032
58973
1137528
338107
1199611
755166
466649
1115234
918314
10188
993437
1130066
206704
887405
1078637
74081
912309
468553
1201715
754750
838895
152869
310715
311898
461430
404874
1055330
50696
913046
123733
622397
574061
123729
1242416
1178969
129297
571388
325689
106800
563776
1116772
1251322
603028
637880
268682
1232615
620418
596968
1211411
540117
180204
263947
1043079
954758
320197
89023
418378
1147269
262828
1177070
943826
554082
382864
665114
1035608
583215
570899
1008631
1139538
505109
37544
1130735
206028
425645
869116
1052757
420162
328770
63438
310946
877551
204619
1025906
91776
46632
645691
1222137
687248
209134
1189819
1094654
73541
175320
285089
337668
583724
950263
431374
924085
727461
652298
709990
261405
533665
305575
764222
722848
350070
1199853
115605
817044
99007
813966
1187580
152764
1212407
1146383
868604
452234
1044918
62601
1107836
859796
245350
1198004
118117
325514
1264524
1171042
78329
128681
1064394
111545
690862
155123
1114925
980190
574370
350016
48990
531622
1115218
789087
255771
760679
1223427
168702
167881
523818
1255177
722549
1146519
477057
34286
1268093
615116
372285
1144855
353729
978048
295170
705145
179072
445218
820704
201424
491162
190464
785425
544477
23429
1190986
847849
291723
455043
502070
986090
417567
175496
1177325
175159
561328
161023
202573
749032
836827
140402
930575
640040
1077354
1012536
1055697
749244
537574
351795
499376
657548
609328
1044332
730023
243989
887295
80519
1018635
9525
84611
686652
674694
917504
959753
211844
241916
782789
212058
1276130
987607
1074136
1066992
1011366
520408
220420
891572
178289
264628
473672
907783
936310
843908
69161
30444
208083
1247962
632079
1242522
1258617
1231290
166394
604370
601707
1271688
404009
542992
48285
1273372
616299
942778
1219092
645761
1088444
965567
268537
325132
515812
869069
638262
654060
427569
579664
529649
967562
339424
1096529
825744
132514
1268547
688010
209210
1092623
52900
992805
458053
302493
208385
1039430
1160048
764444
455550
1243998
612014
343671
1023347
1129827
1006781
859282
791032
342468
804094
923135
1230062
995174
564217
340316
1132632
589702
311284
415852
478425
325638
805940
299412
1042237
519796
724092
699942
582821
781403
322968
188089
730879
1136616
868251
1031432
1117434
67566
1276202
969073
615063
674164
281432
160287
1274318
215386
374751
1162467
1275448
942298
654307
1024687
806353
194203
1033181
533515
912747
986584
1186211
902897
1277184
1003927
1159094
1035456
66932
494239
998371
536858
715243
314405
336332
584140
495200
171767
125436
1136590
975821
1227364
222056
59627
19081
275889
712914
1182011
705351
215331
100026
668632
1062542
942624
610351
456292
438968
1202570
849663
842060
1253454
310620
1217758
525235
1135820
714808
806852
487438
1092239
951813
121620
1133315
1014410
764543
656899
827944
457378
149658
954529
344042
672715
206945
411648
920765
900780
865142
201405
146505
949427
342956
487897
395471
493734
855421
556589
176957
243563
254428
808403
583011
894550
1030549
969964
322187
721442
520522
386122
1197478
987946
1263085
1088934
159979
348415
286251
35266
780648
975311
719983
583072
82203
110325
59039
40669
485839
658162
615579
284913
400007
146407
496829
1274503
914783
376576
1042000
694180
273018
693090
184463
1190452
851173
706238
727954
991824
715883
290616
480610
2732
909228
703353
902497
1194975
1065977
493296
193601
1181831
784554
819389
666801
131273
327737
639496
646540
477804
669656
474435
470363
639295
680321
735467
394526
347209
1219106
114584
719531
780953
239508
979778
748798
34362
1239563
1249058
658239
650833
1169780
567387
163759
846983
491298
666177
1189315
6382
2011
710966
1044682
885097
951389
309689
524021
418161
738093
803831
435460
732181
43449
974445
1134164
1109860
1216342
912474
1225374
1277369
35859
146822
1003758
517635
841307
435242
372608
1145680
281753
1015357
833057
152306
1263776
727296
148073
201727
768439
1151982
654145
815072
528033
1034999
857928
1224455
235997
1125763
407809
174565
126454
697190
128048
521331
455910
556812
1171666
155677
211249
987099
263176
31048
863015
755610
714189
1038475
990205
703894
196946
1078737
755955
600346
571726
342536
778474
845928
373282
324899
447287
912949
1060686
983982
840522
835952
812369
405625
1065319
609214
960917
1182101
322162
1188752
133531
381654
176542
704068
912506
174092
198885
193718
775675
1001548
767981
782805
851845
325725
1183473
76952
455959
1111108
517469
811924
604396
430238
351754
550094
838842
1270390
165028
512606
518609
238350
909429
138455
1070605
575205
1002590
116645
901578
36770
141180
870861
655343
110217
644712
1134560
1054319
503549
652472
601572
188396
1129442
1276521
821673
359239
474610
16099
142193
958946
1164780
100764
543362
131698
948473
1049986
515675
1014562
859879
880686
343743
941983
811899
1275906
400858
560016
979255
830198
1169457
1167072
180266
142132
991758
1262552
193961
704393
970848
830293
1089544
582755
889219
907731
119641
42673
617016
883811
1243787
1032353
825577
119677
490620
53952
1218245
358739
780261
271777
976797
568118
969265
903384
1156583
334864
163395
971310
146960
1269457
529605
789399
854888
655918
493523
618436
1117462
974472
927013
1165549
12345
1133418
855954
410290
11114
595905
673394
140843
759592
1238896
982515
180060
500347
685144
77612
728787
943319
109236
450835
709291
370709
187037
465617
265506
341260
1200023
790368
576926
523427
387518
859538
1082871
362779
330064
1191112
12097
834763
251230
991642
32645
60758
233687
255778
578298
1024610
1194809
1068182
591901
899070
428121
999654
577694
464075
1183280
537280
1240491
128595
154155
862771
325863
1204485
1049166
834256
1197247
1051896
767245
272641
426715
1241311
1235309
292480
8867
874947
263483
644471
545031
714978
252286
1073607
486921
237382
927433
69959
241437
1020830
422023
77031
1259645
145945
1175547
230624
207175
382218
853396
425685
349063
196999
1245733
1210626
1200112
37223
896051
1144961
244356
1013455
742201
672851
228850
577466
336157
210871
1065342
390901
1085632
803762
880593
138531
174860
952509
179315
822512
563879
416832
165321
975137
392230
902319
573843
614854
46537
267391
1173936
1121268
1010012
428265
830760
995431
47648
272815
495427
218734
675533
1148101
195700
1123050
616609
38999
1270407
988798
1156787
494458
406893
109791
76687
441797
288820
777618
1174091
616202
870247
68119
505293
1260140
936088
524183
64963
1065827
1155497
1013557
376684
1077373
16303
1146685
729151
1200536
1018895
609073
484009
713121
692831
856952
696569
551889
195941
1086433
284635
44202
667407
290063
218878
348663
106694
1082153
469624
1220953
126891
42276
831803
385145
765081
348605
308690
524554
1051377
1132425
1258087
836831
930498
998117
1217368
369083
467407
1210811
450279
696473
782292
680217
1069927
296474
1077659
946008
215335
1064575
1271289
785533
23627
1256400
645651
408140
418018
968456
1136961
992706
409638
225452
547827
1116289
819109
685996
647177
755300
70322
854619
1078192
301977
175374
373220
369951
622215
233278
226010
1046495
648186
1041630
264751
511867
624657
412339
357371
954541
1004156
638480
1162677
280823
34803
1017445
1111350
881873
1153509
338949
341633
893536
927141
637153
224736
767665
552205
231320
689066
1182240
1250262
558314
1040378
33947
803740
1080416
711507
945855
72642
944601
257556
796624
285010
42815
556830
701146
43062
341416
594333
578235
1169018
75941
1005612
331797
18140
1260636
444511
76258
872623
1100255
975638
269173
521449
929257
869170
17052
228186
963831
878058
59566
489012
620352
78851
990092
277171
896525
1029655
1026297
681500
388597
1118047
604803
995415
210454
877814
916909
835989
350287
1115385
160212
1031337
1095145
400094
242135
592426
184593
6012
130463
1159749
383081
632760
729529
448148
379398
1254566
31255
882006
692376
885589
470562
1145286
559236
148335
758734
1171306
916825
146133
325176
404535
296521
455841
1230457
996852
908312
946040
111271
892008
1157823
553023
576871
939604
190247
196052
977949
1167816
364839
632129
931971
850300
283959
360315
1060937
379730
956558
1201965
495458
26929
728856
138526
1208158
675660
482834
22080
1039051
732758
290479
10460
487818
185144
349314
258590
1095442
979950
405082
1203962
490060
1126789
1115357
932884
405349
42084
487262
747310
726581
403368
1199653
419386
364084
740006
1216839
356681
988988
798579
428316
911166
340371
864084
801308
186734
1138556
121152
598459
715361
150178
869091
742170
93290
153944
142305
241062
426497
265688
240278
296966
991365
145048
669669
131604
280500
235599
292593
1111834
805193
898847
493556
54422
299043
998262
302083
1192887
1064721
278311
665635
530218
151625
999915
114395
1181183
528668
1176501
219852
79032
1105753
944562
656197
440310
1005302
994593
818185
1142696
37879
1262722
1194382
988817
1235237
1221174
1158678
596191
620593
1204309
1056669
100905
441563
1138292
738871
290669
922481
31313
1111619
498548
1043751
226561
368181
563363
507291
46024
503239
929927
201186
367991
892431
238783
529913
319189
837601
209960
320307
111028
863486
568064
16163
894419
835910
530406
24393
293137
581310
1264358
1151468
403067
1094382
711643
889622
620466
599185
539165
37263
372894
11236
496963
926424
244793
1251959
386228
741443
602143
556259
1129871
1268420
449361
305197
400844
877169
493462
668212
794238
880720
778672
836296
594040
1009872
950858
1241364
1050601
589908
1108784
377549
169263
1242205
101747
565522
723480
976550
573140
564393
1108605
611854
185749
1037466
790525
1044446
339937
6467
394010
275067
222523
970203
177417
535449
1004316
1042233
523310
683190
555573
682277
897195
1063116
375642
42455
522881
310362
586953
30924
875375
1032943
1126059
1069169
653085
633375
1071262
797986
1149821
568262
897641
20755
1006928
804365
975416
600353
822242
526710
375849
53413
503111
652589
28386
43865
489277
526021
384141
377245
379303
144005
263733
632093
698728
1190982
260406
828887
215355
1259953
875312
1160131
126623
916107
1068027
249952
1251754
260398
1222157
860246
819375
672368
204798
1199312
733728
34039
831269
324888
368833
1242255
130778
851165
454623
287189
676286
1144056
600425
602038
853979
352832
132000
426032
844888
1036759
423337
561316
1199579
336994
555665
933419
1276169
591818
1021765
776758
960610
422265
739469
1235758
687168
374960
1062095
120628
565054
1071475
66675
836839
639371
303136
1008351
352993
946221
964654
26348
745688
474899
652118
688123
295891
592462
74751
674501
1068760
364275
53300
912630
459578
476347
561055
200064
976984
789945
582356
389315
1263939
1231166
306891
512694
586664
689961
418518
293230
539902
921078
742164
1067808
1137951
835518
534823
353043
822398
392606
92094
845690
1240379
808332
861803
415316
607146
934061
612177
627663
1022216
86036
183649
428076
824416
729310
190629
764180
308515
820534
1022075
843469
131364
136618
739636
999203
831332
314047
800650
1243502
889333
1057650
106561
207414
38922
1089257
1079430
1006803
1093436
707027
261501
20392
253186
281403
1226134
270287
